{"bucket": "protein", "source": "Nature (main journal)", "source_type": "rss", "title": "Editorial Expression of&#xa0;Concern: The gene product Murr1 restricts HIV-1 replication in resting CD4+ lymphocytes", "url": "https://www.nature.com/articles/s41586-026-10308-x", "one_liner": "<p>Nature, Published online: 27 February 2026; <a href=\"https://www.nature.com/articles/s41586-026-10308-x\">doi:10.1038/s41586-026-10308-x</a></p>Editorial Expression of&#xa0;Concern: The gene product Murr1 restricts HIV-1 replication in resting CD4+ lymphocytes", "tags": ["protein-design", "nature", "journal"], "extracted_chars": 3866, "has_fulltext": true, "analysis": "CORE CLAIM:\nThe Editors are issuing an expression of concern for the 2003 article \"The gene product Murr1 restricts HIV-1 replication in resting CD4+ lymphocytes\" because in Fig. 3b, the control panels were duplicated.\n\nMETHOD / APPROACH:\nNot stated in source text. The provided text is an editorial notice, not the original research article. It does not describe the experimental methods used in the 2003 study.\n\nKEY EVIDENCE:\nThe specific evidence for the concern is the duplication of control panels in Fig. 3b of the original article. The notice states that separate panels in Fig. 3c and d independently confirm specificity with respect to two reference genes (Skp1 and Actin). The raw data for the original article is no longer available for verification.\n\nWHY IT MATTERS:\nData integrity and transparency are fundamental to scientific reproducibility. The duplication of control panels in a key figure raises questions about the reliability of the presented evidence for the activity of the Murr1 siRNA and the specificity of the knockdown effect. The unavailability of raw data prevents independent verification of the findings.\n\nLIMITATIONS / UNCERTAINTIES:\nThe raw data for the 2003 article is no longer available, making it impossible to verify the original results or assess the full impact of the duplicated panels. The notice does not conclude that the conclusions are invalid, only that a figure contains duplicated elements, creating uncertainty about the robustness of that specific evidence.\n\nTERMS (simple explanations):\n*   **Expression of Concern:** A formal notice from a journal's editors alerting readers to a potential problem with a published article.\n*   **Murr1:** The gene/protein studied in the original research.\n*   **HIV-1:** The virus that causes AIDS.\n*   **Resting CD4+ lymphocytes:** A type of immune cell that HIV infects; \"resting\" means they are not actively dividing.\n*   **siRNA (small interfering RNA):** A tool used in labs to silence or reduce the expression of a specific gene.\n*   **Knockdown:** The reduction of a gene's expression, often achieved using siRNA.\n*   **Control panels:** Parts of a scientific figure showing baseline or comparison data to validate an experimental result.\n*   **Reference genes (Skp1, Actin):** Genes whose expression is assumed to be stable, used as a baseline to normalize and compare other gene expression measurements."}
{"bucket": "protein", "source": "Nature (main journal)", "source_type": "rss", "title": "Is a ‘selfish gene’ making a Utah family have twice as many boys as girls?", "url": "https://www.nature.com/articles/d41586-026-00505-z", "one_liner": "<p>Nature, Published online: 27 February 2026; <a href=\"https://www.nature.com/articles/d41586-026-00505-z\">doi:10.1038/d41586-026-00505-z</a></p>Genealogy study claims first conclusive case of sex ‘distortion’ in humans — but not all researchers are convinced.", "tags": ["protein-design", "nature", "journal"], "extracted_chars": 3562, "has_fulltext": true, "analysis": "CORE CLAIM:\nResearchers have identified a seven-generation Utah family with a sustained, statistically significant male-biased sex ratio (60 males to 29 females), providing the first clear evidence in humans of a potential Y-chromosome \"sex distorter\" gene—a type of \"selfish gene\" that biases its own transmission by producing more male offspring.\n\nMETHOD / APPROACH:\nThe study analyzed anonymized genealogical data from the Utah Population Database, which spans from the late 18th century to the present. The researchers focused on paternal lineages (family lines traced through fathers) because Y-chromosome-based sex distorters are theoretically easier to detect in genealogical records than X-chromosome distorters. They applied two unspecified statistical tests to the recorded sexes of 76,445 individuals across more than 26,000 paternal lineages to identify families with a male bias unlikely to occur by chance.\n\nKEY EVIDENCE:\nOne family met the criteria of both statistical tests. Across seven documented generations, this family produced 60 male offspring and 29 female offspring"}
{"bucket": "protein", "source": "Nature (main journal)", "source_type": "rss", "title": "I will continue the fight for environmental justice in Black communities", "url": "https://www.nature.com/articles/d41586-026-00538-4", "one_liner": "<p>Nature, Published online: 27 February 2026; <a href=\"https://www.nature.com/articles/d41586-026-00538-4\">doi:10.1038/d41586-026-00538-4</a></p>Nicknamed the father of environmental justice, Robert Bullard argues that researchers in the field have more reason than ever to back up their work with action.", "tags": ["protein-design", "nature", "journal"], "extracted_chars": 6300, "has_fulltext": true, "analysis": "CORE CLAIM:\nEnvironmental justice requires integrating scientific research with community-driven action (e.g., lawsuits, policy advocacy) to achieve transformative change; data alone is insufficient without this marriage to activism.\n\nMETHOD / APPROACH:\nCommunity-based participatory research, driven from the \"bottom up\" by communities partnering with academic researchers to define questions and package concerns for policymakers. This approach treats the environment as encompassing all spaces where people live, work, learn, play, and worship.\n\nKEY EVIDENCE:\n1.  Bullard's late 1970s research in Houston, Texas, documented that solid-waste landfill sites were disproportionately located in predominantly Black neighborhoods.\n2.  His 1990 book *Dumping in Dixie* chronicled actions by five predominantly Black communities in the southern US to combat deadly pollution, becoming a standard textbook.\n3.  The foundational research and theoretical framework for the movement came from five HBCU-based centers (e.g., Environmental Justice Resource"}
{"bucket": "protein", "source": "Nature (main journal)", "source_type": "rss", "title": "Pokémon turns 30 — how the fictional pocket monsters shaped science", "url": "https://www.nature.com/articles/d41586-026-00441-y", "one_liner": "<p>Nature, Published online: 27 February 2026; <a href=\"https://www.nature.com/articles/d41586-026-00441-y\">doi:10.1038/d41586-026-00441-y</a></p>The Japanese media sensation has inspired generations of researchers in fields as diverse as evolution, biodiversity and research integrity.", "tags": ["protein-design", "nature", "journal"], "extracted_chars": 3835, "has_fulltext": true, "analysis": "CORE CLAIM:\nPokémon, as a cultural phenomenon, has demonstrably influenced scientific research, taxonomy, museum exhibitions, and science education by providing familiar frameworks for classification, evolution, and ecological concepts, and by inspiring the creation of new educational tools.\n\nMETHOD / APPROACH:\nThe article synthesizes qualitative evidence from interviews with multiple scientists who were Pokémon fans, analyzes specific named examples of species and fossils inspired by Pokémon, and references published surveys and educational studies (e.g., a 2002 UK survey, the 2010 Phylo card game project).\n\nKEY EVIDENCE:\n1.  Scientists explicitly state Pokémon shaped their childhood understanding of natural history and mirrors their professional work (e.g., collecting and classifying Pokémon akin to entomology and taxonomy).\n2.  Direct naming of real species after Pokémon (e.g., the bee *Chilicola charizard*).\n3.  A museum exhibition (Field Museum) explicitly linking Pokémon designs to real fossil taxa (e.g., Aerodactyl to pterosaurs, Archeops to *Archaeopteryx*).\n4.  A 2002 survey finding children could name more Pokémon than local wildlife.\n5.  Development of the \"Phylo\" card game, a Pokémon-inspired educational tool for teaching ecosystems, food chains, and environmental threats.\n\nWHY IT MATTERS:\nIt illustrates how pervasive pop culture can serve as a powerful, unexpected scaffold for public scientific engagement, education, and even professional inspiration. It demonstrates a concrete pathway for translating childhood interests into sustained scientific literacy and career paths, and provides a model for designing effective science communication tools that leverage existing cultural familiarity.\n\nLIMITATIONS / UNCERTAINTIES:\n1.  Evidence is anecdotal and based on self-reported influence from a specific, non-random subset of scientists (those who were Pokémon fans and chose to comment)."}
{"bucket": "protein", "source": "Nature (main journal)", "source_type": "rss", "title": "Brain mysteries and Bronze Age diplomacy: Books in brief", "url": "https://www.nature.com/articles/d41586-026-00621-w", "one_liner": "<p>Nature, Published online: 27 February 2026; <a href=\"https://www.nature.com/articles/d41586-026-00621-w\">doi:10.1038/d41586-026-00621-w</a></p>Andrew Robinson reviews five of the best science picks.", "tags": ["protein-design", "nature", "journal"], "extracted_chars": 1730, "has_fulltext": true, "analysis": "CORE CLAIM: Historian Alison Bashford explores the historical interpretations of hand features (like creases) by physicians, scientists, and anthropologists, framing it as a history of reading \"mysterious, curious, and often complex codes.\"\nMETHOD / APPROACH: Historical analysis of scientific and medical literature and practices from the mid-20th century and earlier.\nKEY EVIDENCE: The work of geneticist Lionel Penrose, who published correlations between genetic abnormalities and hand creases in a 1973 Lancet paper titled ‘Fingerprints and palmistry’.\nWHY IT MATTERS: It reveals how physical features of the body have been used to infer internal states, genetics, and character, reflecting broader histories of medicine, anthropology, and pseudoscience.\nLIMITATIONS / UNCERTAINTIES: The text is a book review summary; the primary source is Bashford's historical analysis itself. Not stated in source text: specific arguments, other key figures beyond Penrose, or the book's chronological scope.\nTERMS (simple explanations):\n- Palmistry: The practice of interpreting lines and features of the palm to predict character or fate.\n- Genetic abnormalities: Conditions caused by mutations or errors in DNA.\n\nCORE CLAIM: Given that mitigation efforts have failed to meet climate targets, human geographer Wim Carton and human ecologist Andreas Malm argue the world must urgently focus on three remaining options: adaptation, carbon dioxide removal, and solar geoengineering.\nMETHOD / APPROACH: Analysis of current climate policy failures and technical/strategic options for responding to global warming.\nKEY EVIDENCE: The statistic that in 2023, the United States \"pumped more oil and gas than any country had ever done in history,\" indicating continued fossil fuel dominance.\nWHY IT MATTERS: It presents a stark, pragmatic framework for climate action in a scenario of likely overshooting temperature goals, influencing policy and public discourse on emergency responses.\nLIMITATIONS / UNCERTAINTIES: The text is a book review summary; the primary source is Carton and Malm's analysis. Not stated in source text: specific critiques of the three options, detailed proposals, or the book's definition of \"mitigation\" failure.\nTERMS (simple explanations):\n- Mitigation: Efforts to reduce or prevent greenhouse gas emissions.\n- Geoengineering: Large-scale technological interventions in Earth's climate system, e.g., to block sunlight.\n- Carbon dioxide removal: Technologies or natural processes that extract CO2 from the atmosphere.\n\nCORE CLAIM: Archaeologist Eric H. Cline examines the Amarna letters—clay tablets with cuneiform script—as a"}
{"bucket": "protein", "source": "Nature (main journal)", "source_type": "rss", "title": "White House stalls release of approved US science budgets", "url": "https://www.nature.com/articles/d41586-026-00601-0", "one_liner": "<p>Nature, Published online: 27 February 2026; <a href=\"https://www.nature.com/articles/d41586-026-00601-0\">doi:10.1038/d41586-026-00601-0</a></p>The US Congress rejected sweeping cuts to science agencies. But the NIH, the NSF and NASA have had their spending slowed.", "tags": ["protein-design", "nature", "journal"], "extracted_chars": 4642, "has_fulltext": true, "analysis": "CORE CLAIM:\nThe White House Office of Management and Budget (OMB) is delaying the release of Congressionally-approved 2026 funding to major US science agencies (NIH, NSF, NASA), restricting their ability to spend money and award new research grants, representing a significant shift in the traditional budget execution process.\n\nMETHOD / APPROACH:\nThe OMB altered standard procedures by revising Circular A-11 (the \"Budget Bible\") to limit automatic 30-day funding increments to \"essential expenses\" like salaries. For NASA, it used a footnote in a budgetary notice to explicitly withhold spending authority for ten specific programs until further justification is provided.\n\nKEY EVIDENCE:\n*   **NIH:** Has received zero approval to spend its 2026 appropriations. It can only issue new grants using"}
{"bucket": "journal", "source": "Nature Chemical Biology", "source_type": "rss", "title": "Defining and refining the cysteine redoxome through sulfur chemical biology", "url": "https://www.nature.com/articles/s41589-026-02145-w", "one_liner": "<p>Nature Chemical Biology, Published online: 27 February 2026; <a href=\"https://www.nature.com/articles/s41589-026-02145-w\">doi:10.1038/s41589-026-02145-w</a></p>This study provides a chemical framework of sulfur, defining the cysteine redoxome, linking thiol reactivity with oxoform kinetics/dynamics to proteome-wide mapping, occupancy and flux, and reve...", "tags": ["chemical-biology", "journal"], "extracted_chars": 16293, "has_fulltext": true, "analysis": ""}
{"bucket": "ai_bio", "source": "Endpoints News", "source_type": "rss", "title": "Ascendis wins FDA approval for achondroplasia drug, waits on EU action", "url": "https://endpoints.news/ascendis-wins-fda-approval-for-achondroplasia-drug-waits-on-eu-action/", "one_liner": "The FDA on Friday approved Ascendis Pharma’s once-weekly treatment for achondroplasia, a form of dwarfism, setting up what could become a three-way competition among drugmakers.\n\n The drug, known as navepegritide or TransCon CNP, will be ...", "tags": ["biotech", "industry"], "extracted_chars": 1209, "has_fulltext": false, "analysis": "CORE CLAIM:\nAscendis Pharma has received FDA approval for a once-weekly treatment for achondroplasia, a form of dwarfism, positioning it for potential competition with other drugmakers.\n\nMETHOD / APPROACH:\nNot stated in source text.\n\nKEY EVIDENCE:\nNot stated in source text.\n\nWHY IT MATTERS:\nAchondroplasia is the most common form of dwarfism. An approved pharmaceutical treatment represents a significant development for a condition with limited therapeutic options. The approval sets up a competitive market landscape.\n\nLIMITATIONS / UNCERTAINTIES:\nThe full article content is behind a paywall, preventing access to details on the drug's name, clinical trial data, specific mechanism of action, regulatory history, or the nature of the anticipated three-way competition. The status of EU regulatory action is mentioned but not detailed.\n\nTERMS (simple explanations):\n*   **Achondroplasia:** A genetic condition that is the most common cause of dwarfism, affecting bone growth.\n*   **FDA approval:** The U.S. Food and Drug Administration's official authorization for a drug to be marketed and prescribed.\n*   **Once-weekly treatment:** A medication administered one time per week.\n*   **Three-way competition:** A market scenario where three different companies are selling competing products for the same medical condition."}
{"bucket": "ai_bio", "source": "Endpoints News", "source_type": "rss", "title": "Novartis, Takeda to enter next Medicare drug price negotiations", "url": "https://endpoints.news/novartis-takeda-to-enter-next-medicare-drug-price-negotiations/", "one_liner": "At least two big pharma companies have said they will participate in the upcoming third round of Medicare negotiations under the Inflation Reduction Act, as court challenges against the program persist.\n\n Novartis confirmed to  ...", "tags": ["biotech", "industry"], "extracted_chars": 1178, "has_fulltext": false}
{"bucket": "ai_bio", "source": "Endpoints News", "source_type": "rss", "title": "GLP-1 news galore; Top 100 venture investors; Doug Ingram to step down; and more", "url": "https://endpoints.news/glp-1-news-galore-top-100-venture-investors-doug-ingram-to-step-down-and-more/", "one_liner": "Happy Saturday, and welcome back to Endpoints Weekly. Our senior biopharma journalist Elizabeth Cairns covered a flurry of readouts this week from Eli Lilly and Novo Nordisk. We’ve summarized the data below, as well as ...", "tags": ["biotech", "industry"], "extracted_chars": 1419, "has_fulltext": false, "analysis": "CORE CLAIM:  \nNot stated in source text. The provided text is a newsletter index/teaser page, not the full article content. Headlines suggest topics include GLP-1 drug trial results, venture investor rankings, and a CEO stepping down, but no core scientific claim is presented.\n\nMETHOD / APPROACH:  \nNot stated in source text. No description of a study method, experimental approach, or analytical technique is included in the visible text.\n\nKEY EVIDENCE:  \nNot stated in source text. No data, results, or specific evidence from any study or report is provided. The text only lists headline topics (e.g., \"Novo Nordisk’s CagriSema beaten by Lilly’s Zepbound in head-to-head obesity trial\").\n\nWHY IT MATTERS:  \nNot stated in source text. The significance or implications of the mentioned topics are not explained in the provided snippet.\n\nLIMITATIONS / UNCERTAINTIES:  \nNot stated in source text. No discussion of limitations, uncertainties, or caveats related to any research or news is included.\n\nTERMS (simple explanations):\n- **GLP-1**: A hormone that stimulates insulin secretion and is targeted by drugs for diabetes and obesity (e.g., semaglutide, tirzepatide).\n- **Duchenne biotech**: Refers to a biotechnology company focused on Duchenne muscular dystrophy, a severe genetic muscle-wasting disorder.\n- **Head-to-head obesity trial**: A clinical study directly comparing two or more obesity treatments against each other in the same patient population."}
{"bucket": "journal", "source": "Nature Chemical Biology", "source_type": "rss", "title": "Mast cell extracellular granules are bioactive condensates assembled by heparin and polyamine", "url": "https://www.nature.com/articles/s41589-026-02165-6", "one_liner": "<p>Nature Chemical Biology, Published online: 27 February 2026; <a href=\"https://www.nature.com/articles/s41589-026-02165-6\">doi:10.1038/s41589-026-02165-6</a></p>Mast cells are immune cells that release membraneless mast cell extracellular granules (MCEGs) in response to allergic inflammation and pathogen infection. MCEGs are found to be condensates form...", "tags": ["chemical-biology", "journal"], "extracted_chars": 33568, "has_fulltext": true, "analysis": ""}
{"bucket": "ai_bio", "source": "Endpoints News", "source_type": "rss", "title": "Merck cuts more than 150 jobs at new Gardasil vaccine plant in North Carolina", "url": "https://endpoints.news/merck-cuts-more-than-150-jobs-at-new-gardasil-vaccine-plant-in-north-carolina/", "one_liner": "Merck is shedding more than 150 jobs in North Carolina, almost all of which are tied to a vaccine manufacturing plant that was unveiled less than a year ago.\n\n The headcount reductions were disclosed in ...", "tags": ["biotech", "industry"], "extracted_chars": 1324, "has_fulltext": false, "analysis": "CORE CLAIM:\nMerck is cutting more than 150 jobs, almost all tied to a newly unveiled Gardasil vaccine manufacturing plant in North Carolina, as demand for the vaccine slumps.\n\nMETHOD / APPROACH:\nNot stated in source text. The provided text is a headline and introductory paragraph of a news article; no methodology is described.\n\nKEY EVIDENCE:\n- The action: Cutting more than 150 jobs.\n- The location: A vaccine manufacturing plant in North Carolina.\n- The timing: The plant was \"unveiled less\" than a short time before the cuts (exact timeframe not specified in visible text).\n- The stated reason: \"as Gardasil slumps,\" implying a decline in demand or sales for the HPV vaccine.\n\nWHY IT MATTERS:\nIt indicates a significant operational reversal for a major pharmaceutical product (Gardasil) at a newly constructed, presumably expensive, manufacturing facility. This suggests a rapid change in market dynamics or demand forecasts for the vaccine, impacting production planning and employment.\n\nLIMITATIONS / UNCERTAINTIES:\n- The full article text is behind a paywall; the visible excerpt is extremely limited.\n- The specific cause and scale of the \"slump\" in Gardasil demand are not detailed.\n- The exact timeline of the plant's opening and the job cuts is incomplete (\"unveiled less…\").\n- No information on whether the cuts are temporary or permanent, or if production is being scaled back or halted.\n- No data on the plant's total capacity or the percentage of the workforce being cut.\n\nTERMS (simple explanations):\n- **Gardasil:** A vaccine manufactured by Merck to prevent infection from certain types of human papillomavirus (HPV), which can cause cancers.\n- **Vaccine manufacturing plant:** A specialized factory designed to produce vaccines under strict sterile and regulatory conditions.\n- **Slumps (in this context):** A significant decline in sales or demand for a product."}
{"bucket": "ai_bio", "source": "Endpoints News", "source_type": "rss", "title": "WuXi XDC makes an ADC linker deal with Earendil for up to $885M", "url": "https://endpoints.news/wuxi-xdc-makes-an-adc-linker-deal-with-earendil-for-up-to-885m/", "one_liner": "WuXi Biologics' antibody-drug conjugate spinout WuXi XDC said on Friday that it will be working with Earendil Labs to develop new ADCs.\n\n AI-driven biologics developer Earendil will have access to WuXi ...", "tags": ["biotech", "industry"], "extracted_chars": 1290, "has_fulltext": false, "analysis": "CORE CLAIM:  \nWuXi XDC has entered a partnership with Earendil Labs to develop new antibody-drug conjugate (ADC) linkers, in a deal potentially valued at up to $885 million.\n\nMETHOD / APPROACH:  \nNot stated in source text.\n\nKEY EVIDENCE:  \nThe announcement states the deal is \"for up to $885M\" and involves collaboration on \"new\" ADC linker development. No further details on specific technologies, stages, or terms are provided.\n\nWHY IT MATTERS:  \nNot stated in source text.\n\nLIMITATIONS / UNCERTAINTIES:  \nThe article is truncated behind a paywall; the full details of the collaboration scope, payment structure, and specific scientific or commercial goals are not available in the provided text.\n\nTERMS (simple explanations):  \n- **ADC (Antibody-Drug Conjugate)**: A targeted cancer therapy that links an antibody (which seeks cancer cells) to a toxic drug.\n- **Linker**: The chemical component that connects the antibody and the drug in an ADC; it must be stable in the bloodstream but release the drug inside the cancer cell."}
{"bucket": "ai_bio", "source": "Endpoints News", "source_type": "rss", "title": "Investors are pumping money into AI tools for health insurers", "url": "https://endpoints.news/investors-are-pumping-money-into-ai-tools-for-health-insurers/", "one_liner": "In the past month, payer AI startups including Anterior, Daffodil Health and Alaffia Health all raised tens of millions in fresh venture funding as insurers strive to match hospitals and health systems in an ongoing ...", "tags": ["biotech", "industry"], "extracted_chars": 1343, "has_fulltext": false, "analysis": "CORE CLAIM:\nInvestors are providing significant venture funding to startups developing AI tools specifically for health insurance companies (payers).\n\nMETHOD / APPROACH:\nNot stated in source text. The article is a headline and brief lede; it does not describe the methods or approaches of the AI tools or the investment process.\n\nKEY EVIDENCE:\nThe article explicitly names three payer AI startups—Anterior, Daffodil Health, and Alaffia Health—that \"all raised tens of millions in fresh venture funding\" in the past month.\n\nWHY IT MATTERS:\nNot stated in source text. The article does not explain the significance, potential impact on the healthcare system, insurers, or patients.\n\nLIMITATIONS / UNCERTAINTIES:\nThe source text is extremely limited, consisting only of a headline, a sub-headline, and a single sentence of lede before a paywall. It provides no details on the specific AI applications, the amount of funding, the investors, the problems the tools solve, or any analysis of the trend's implications.\n\nTERMS (simple explanations):\n*   **Payer AI:** Artificial intelligence tools designed for use by health insurance companies (the \"payers\" of medical claims).\n*   **Venture funding:** Investment capital provided by venture capital firms to early-stage, high-potential companies.\n*   **Startups:** Newly established companies, typically in the early stages of operations and seeking growth."}
{"bucket": "ai_bio", "source": "Endpoints News", "source_type": "rss", "title": "US International Trade Commission to take a closer look at Chinese biotech", "url": "https://endpoints.news/us-international-trade-commission-to-take-a-closer-look-at-chinese-biotech/", "one_liner": "The US International Trade Commission is opening an investigation into China's support for biotech as well as the country's pricing practices, looking at whether the government there \"manipulated markets and disadvantaged American biotechnology firms.\"  ...", "tags": ["biotech", "industry"], "extracted_chars": 1349, "has_fulltext": false, "analysis": "CORE CLAIM:\nThe US International Trade Commission (ITC) is opening an investigation into China's support for its biotech industry and the country's pricing practices.\n\nMETHOD / APPROACH:\nNot stated in source text.\n\nKEY EVIDENCE:\nNot stated in source text.\n\nWHY IT MATTERS:\nNot stated in source text.\n\nLIMITATIONS / UNCERTAINTIES:\nThe full article content is behind a paywall; the provided text only contains the headline, byline, and a prompt to sign up for access. No details about the investigation's scope, specific sectors, timeline, or potential outcomes are available in the given text.\n\nTERMS (simple explanations):\n*   **US International Trade Commission (ITC):** A US government agency that investigates trade issues, including whether foreign practices harm US industries.\n*   **Biotech:** Short for biotechnology; the use of living systems and organisms to develop or make products, often referring to pharmaceuticals and medical treatments.\n*   **Pricing practices:** The methods and strategies used to set the prices for goods or services."}
{"bucket": "ai_bio", "source": "Endpoints News", "source_type": "rss", "title": "Ginkgo divests biosecurity arm; J&J's early prostate cancer data", "url": "https://endpoints.news/ginkgo-divests-biosecurity-arm-jjs-early-prostate-cancer-data/", "one_liner": "⚠️ Ginkgo Bioworks' biosecurity deal: The company is selling its biosecurity unit to a \"consortium of investors,\" which will operate it as a standalone business. In exchange, Ginkgo will get ...", "tags": ["biotech", "industry"], "extracted_chars": 1177, "has_fulltext": false, "analysis": "CORE CLAIM:\nGinkgo Bioworks is selling its biosecurity unit to a consortium of investors. Johnson & Johnson (J&J) has presented early data on a prostate cancer treatment.\n\nMETHOD / APPROACH:\nNot stated in source text. The article is a news briefing headline without methodological details for either story.\n\nKEY EVIDENCE:\n*   **Ginkgo:** The company is divesting its biosecurity arm via a sale to a \"consortium of investors,\" who will operate the unit post-sale.\n*   **J&J:** The article references \"J&J’s early prostate cancer data\" but provides no details, results, or context for this data.\n\nWHY IT MATTERS:\n*   **Ginkgo:** This represents a significant strategic shift for the synthetic biology company, exiting a major business segment (biosecurity) to presumably focus on other areas like cell engineering and biopharma.\n*   **J&J:** Early clinical data for a prostate cancer therapy is a material update for investors and clinicians regarding the development pipeline of a major pharmaceutical company, potentially impacting treatment landscapes and stock valuation.\n\nLIMITATIONS / UNCERTAINTIES:\n*   The source text is a truncated headline and brief sub-headline from a paywalled/newsletter format. Critical details are absent:\n    *   **Ginkgo:** No financial terms of the sale, timeline, identity of the investor consortium, reasons for the divestiture, or impact on Ginkgo's remaining business are provided.\n    *   **J&J:** No information on the data's phase (e.g., Phase 1, 2), key results (e.g., response rates, survival metrics), patient population, or presentation context (e.g., conference, journal) is included.\n*   The full article content is behind a subscription/paywall, preventing a complete analysis.\n\nTERMS (simple explanations):\n*   **Divest / Divestment:** Selling off a part of a company (a business unit or asset).\n*   **Biosecurity:** Measures to protect against biological threats, including pandemic preparedness and pathogen detection.\n*   **Consortium:** A group of organizations or investors working together on a specific project or acquisition.\n*   **Prostate Cancer Data:** Results from a clinical study testing a new drug or treatment for prostate cancer.\n*   **Early Data:** Initial results from a clinical trial, typically from Phase 1 or 2, focusing on safety and preliminary effectiveness."}
{"bucket": "ai_bio", "source": "Endpoints News", "source_type": "rss", "title": "Padcev-Keytruda combo delivers more positive data in bladder cancer", "url": "https://endpoints.news/padcev-keytruda-combo-delivers-more-positive-data-in-bladder-cancer/", "one_liner": "Researchers have rolled out another win for the Padcev-Keytruda combination, this time as a first treatment for a form of bladder cancer.\n\n It's the second recent win for the combo after last year's positive readout ...", "tags": ["biotech", "industry"], "extracted_chars": 1298, "has_fulltext": false, "analysis": "CORE CLAIM:\nThe Padcev-Keytruda combination has demonstrated positive data as a first-line treatment for a specific form of bladder cancer, representing a second positive outcome for this regimen.\n\nMETHOD / APPROACH:\nNot stated in source text.\n\nKEY EVIDENCE:\nNot stated in source text. The article only reports the conclusion of \"positive data\" without providing study results, metrics, or patient outcomes.\n\nWHY IT MATTERS:\nThe combination of an antibody-drug conjugate (Padcev) and an immunotherapy (Keytruda) is a significant area of research in bladder cancer. Positive first-line data could offer a new, potentially more effective treatment option for patients. The mention of it being a \"second win\" suggests this adds to a growing body of evidence supporting this specific combination strategy.\n\nLIMITATIONS / UNCERTAINTIES:\nNot stated in source text. The article does not specify the form of bladder cancer, the phase of the clinical trial, the magnitude of the benefit, safety data, or comparative efficacy against existing standards of care.\n\nTERMS (simple explanations):\n*   **Padcev (enfortumab vedotin):** An antibody-drug conjugate (ADC) that targets a protein on bladder cancer cells to deliver a chemotherapy drug directly to the tumor.\n*   **Keytruda (pembrolizumab):** A checkpoint inhibitor immunotherapy that helps the body's immune system recognize and attack cancer cells.\n*   **First-line treatment:** The initial treatment given for a disease.\n*   **Bladder cancer:** Cancer that begins in the bladder, most commonly in the cells lining the inside of the bladder."}
{"bucket": "ai_bio", "source": "Endpoints News", "source_type": "rss", "title": "Doug Ingram’s uneven legacy at Sarepta; Merck splits human health business, brings in Sanofi exec", "url": "https://endpoints.news/doug-ingrams-uneven-legacy-at-sarepta-merck-splits-human-health-business-brings-in-sanofi-exec/", "one_liner": "→ Merck said this week that it would divide its human health business into two groups — an oncology business unit and a specialty, pharma &amp; infectious diseases business unit — suggesting that ...", "tags": ["biotech", "industry"], "extracted_chars": 1250, "has_fulltext": false, "analysis": "CORE CLAIM:  \nNot stated in source text. The headline references two topics: 1) Doug Ingram’s “uneven legacy” at Sarepta, and 2) Merck splitting its human health business and hiring a Sanofi executive, but no specific claim is made in the provided text.\n\nMETHOD / APPROACH:  \nNot stated in source text. No description of any study, analysis, or reporting method is included.\n\nKEY EVIDENCE:  \nNot stated in source text. The provided text contains only a headline, byline, and paywall prompts; no evidence, data, or details are presented.\n\nWHY IT MATTERS:  \nNot stated in source text. No explanation of significance or impact is provided.\n\nLIMITATIONS / UNCERTAINTIES:  \nNot stated in source text. The text is a truncated article preview with no substantive content.\n\nTERMS (simple explanations):  \n- **Sarepta**: A biotechnology company focused on neuromuscular diseases (e.g., Duchenne muscular dystrophy).  \n- **Merck**: A global pharmaceutical company (known as MSD outside the U.S. and Canada).  \n- **Sanofi**: A multinational pharmaceutical and healthcare company.  \n*(Note: These definitions are based on general knowledge, not explicit in the source text.)*"}
{"bucket": "ai_bio", "source": "Endpoints News", "source_type": "rss", "title": "Doug Ingram’s force of will meets its match as Sarepta CEO plans to depart", "url": "https://endpoints.news/doug-ingrams-force-of-will-meets-its-match-as-sarepta-ceo-plans-to-depart/", "one_liner": "Doug Ingram’s decision to step down as Sarepta’s CEO by year's end was a shocker, considering his never-say-die reputation.\n\n But after a terrible year and a tanking share price, Sarepta's next leader will have the ...", "tags": ["biotech", "industry"], "extracted_chars": 1440, "has_fulltext": false, "analysis": "CORE CLAIM:  \nDoug Ingram, known for his persistent leadership, is stepping down as CEO of Sarepta by the end of 2026, marking the end of a controversial tenure at the Duchenne muscular dystrophy biotech.\n\nMETHOD / APPROACH:  \nNot stated in source text.\n\nKEY EVIDENCE:  \nNot stated in source text. The article is truncated/paywalled; only the headline, subhead, author, date, and site navigation are visible.\n\nWHY IT MATTERS:  \nNot stated in source text. The article's framing (\"force of will meets its match,\" \"terrible year\") suggests significance, but specific reasons or implications are not provided in the accessible text.\n\nLIMITATIONS / UNCERTAINTIES:  \nThe full article content is behind a paywall/login. The provided text contains no details about the reasons for Ingram's departure, the company's performance, regulatory issues, or successor plans.\n\nTERMS (simple explanations):  \n*   **Duchenne biotech:** A biotechnology company focused on Duchenne muscular dystrophy, a severe genetic muscle-wasting disease.\n*   **Force of will:** A phrase describing determined, persistent, and often uncompromising leadership style.\n*   **Controversial tenure:** A period of leadership marked by significant debate, criticism, or dispute."}
{"bucket": "ai_bio", "source": "Endpoints News", "source_type": "rss", "title": "DOJ urges Supreme Court to undo revival of Hikma ‘skinny label’ case", "url": "https://endpoints.news/doj-urges-supreme-court-to-undo-revival-of-hikma-skinny-label-case/", "one_liner": "The US solicitor general is calling on the Supreme Court to reverse a decision that he says would undermine a pathway commonly used to bring new generic drugs to market.\n\n The case centers on the ...", "tags": ["biotech", "industry"], "extracted_chars": 1208, "has_fulltext": false, "analysis": "CORE CLAIM:\nThe U.S. Solicitor General is urging the Supreme Court to reverse a lower court decision that revived a case involving Hikma Pharmaceuticals' \"skinny label\" strategy, arguing the revival would undermine a common legal pathway.\n\nMETHOD / APPROACH:\nNot stated in source text. The article does not describe the legal arguments, the specific lower court decision being challenged, or the procedural posture of the case.\n\nKEY EVIDENCE:\nNot stated in source text. No details about the case facts, the prior court rulings, the specific \"skinny label\" product at issue, or the evidence presented in lower courts are provided.\n\nWHY IT MATTERS:\nNot stated in source text. The article does not explain the potential impact on the pharmaceutical industry, the \"skinny label\" strategy, patent law, or the FDA's regulatory framework.\n\nLIMITATIONS / UNCERTAINTIES:\nThe source text is a truncated article headline and promotional/subscription content. It provides no substantive details about the legal dispute, the parties' arguments, the history of the case, or the implications of the Supreme Court's potential review.\n\nTERMS (simple explanations):\n*   **Skinny label:** Not defined in source text. In pharmaceutical patent law, this typically refers to a generic drug label that intentionally carves out (or \"carves out\" or \"narrows\") patented method-of-use indications to avoid patent infringement, while still seeking FDA approval for the bulk of the drug's uses.\n*   **Revival:** Not defined in source text. Likely refers to a lower court decision that reinstated or reopened a previously dismissed lawsuit.\n*   **Solicitor General:** The lawyer appointed to represent the U.S. government before the Supreme Court."}
{"bucket": "ai_bio", "source": "Endpoints News", "source_type": "rss", "title": "CHMP recommends Moderna's flu-Covid shot and Novartis pill for hives", "url": "https://endpoints.news/chmp-recommends-modernas-flu-covid-shot-and-novartis-pill-for-hives/", "one_liner": "The European Medicines Agency’s human medicines committee recommended approving six new medicines, including Moderna's flu-Covid-19 combo vaccine and Novartis' pill for hives.\n\n CHMP gives its recommendations to the European Commission, which has the final say ...", "tags": ["biotech", "industry"], "extracted_chars": 1348, "has_fulltext": false, "analysis": "CORE CLAIM:\nThe European Medicines Agency's (EMA) Committee for Medicinal Products for Human Use (CHMP) has recommended approval for six new medicines, specifically including Moderna's combined influenza and Covid-19 vaccine and Novartis's oral pill for treating hives (chronic spontaneous urticaria).\n\nMETHOD / APPROACH:\nNot stated in source text. The article does not describe the clinical trial designs, regulatory review process, or specific data evaluated by the CHMP for these two medicines.\n\nKEY EVIDENCE:\nNot stated in source text. The article provides no data on efficacy, safety, trial results, patient numbers, or comparative effectiveness for either Moderna's flu-Covid shot or Novartis's hives pill.\n\nWHY IT MATTERS:\nIf approved, these medicines would offer new therapeutic options in Europe: a single vaccine for two major respiratory viruses (influenza and Covid-19) and a new oral treatment for chronic hives. This represents progress in vaccine combination technology and dermatological/allergy treatment. However, the specific public health or clinical significance is not detailed in the source.\n\nLIMITATIONS / UNCERTAINTIES:\nThe source text is a very brief news headline/teaser with a paywall. It lacks all substantive details: no efficacy or safety data, no trial phase information, no proposed indications beyond broad categories, no timelines for final EU approval, and no context on the other four recommended medicines. The full article is behind a subscription.\n\nTERMS (simple explanations):\n*   **CHMP:** The Committee for Medicinal Products for Human Use. A key committee of the European Medicines Agency (EMA) that reviews medicines and gives opinions on their marketing authorization for use in the EU.\n*   **Flu-Covid combo vaccine:** A single vaccine injection designed to protect against both seasonal influenza (the flu) and Covid-19.\n*   **Hives (chronic spontaneous urticaria):** A skin condition causing recurring, itchy welts (wheals) without an obvious external trigger, lasting more than six weeks.\n*   **Novartis pill for hives:** An oral medication (specific drug name not provided in the text) intended for the treatment of chronic hives."}
{"bucket": "ai_bio", "source": "Endpoints News", "source_type": "rss", "title": "Viatris plans to lay off up to 10% of staff, discloses Indian factory fire", "url": "https://endpoints.news/viatris-plans-to-lay-off-up-to-10-of-staff-discloses-indian-factory-fire/", "one_liner": "Viatris said it's planning to cut up to 10% of its global workforce in an effort to save up to $700 million a year.\n\n In its fourth-quarter earnings report, the generic drugmaker on Thursday also ...", "tags": ["biotech", "industry"], "extracted_chars": 1141, "has_fulltext": false, "analysis": "CORE CLAIM:\nViatris is planning to cut up to 10% of its global workforce to achieve annual cost savings of up to $700 million, and the company has disclosed a fire at one of its manufacturing facilities in India.\n\nMETHOD / APPROACH:\nNot stated in source text. The article does not describe the methodology behind the workforce reduction plan or the investigation into the factory fire.\n\nKEY EVIDENCE:\nThe company's stated plan to reduce its global workforce by up to 10% and the associated target of up to $700 million in annual savings. The disclosure of a fire at an Indian manufacturing facility.\n\nWHY IT MATTERS:\nA workforce reduction of this magnitude (up to 10% of global staff) signifies a major corporate restructuring aimed at significant cost reduction. The simultaneous disclosure of a major operational incident (a factory fire) at a key manufacturing location suggests potential compounding pressures on the company's operations and financial performance.\n\nLIMITATIONS / UNCERTAINTIES:\nThe provided text is a truncated headline and lead paragraph from a paywalled article. Critical details are missing, including: the specific timeline for the layoffs, which business units or regions will be most affected, the cause and impact of the Indian factory fire (e.g., production halt, financial loss, injuries), and any stated connection between the two events. The full context and analysis are inaccessible without a subscription.\n\nTERMS (simple explanations):\n*   **Lay off / Workforce reduction:** The termination of employment for a group of employees, typically to reduce costs.\n*   **Global workforce:** All employees working for a company worldwide.\n*   **Cost savings:** Money a company saves by reducing expenses.\n*   **Manufacturing facility:** A factory or plant where products are made.\n*   **Disclosed:** Officially made public or revealed."}
{"bucket": "ai_bio", "source": "Endpoints News", "source_type": "rss", "title": "FDA probes internal Prasad complaints with outside help", "url": "https://endpoints.news/fda-probes-internal-prasad-complaints-with-outside-help/", "one_liner": "The FDA has been using an outside investigator in a probe of workplace complaints against CBER Director Vinay Prasad, a source familiar with the matter told Endpoints News.\n\n\n\n Among complaints made against Prasad are that ...", "tags": ["biotech", "industry"], "extracted_chars": 1260, "has_fulltext": false, "analysis": "CORE CLAIM:\nThe FDA is conducting an investigation into internal workplace complaints against CBER Director Vinay Prasad and has engaged an external investigator to assist with the probe.\n\nMETHOD / APPROACH:\nThe FDA is utilizing an outside investigator to conduct the probe.\n\nKEY EVIDENCE:\nA source familiar with the matter confirmed the existence of the probe and the use of an outside investigator. No specific details about the complaints, the investigator, or the scope of the investigation are provided in the source text.\n\nWHY IT MATTERS:\nNot stated in source text. (The potential significance would relate to FDA leadership, workplace culture, and regulatory oversight, but the article does not elaborate.)\n\nLIMITATIONS / UNCERTAINTIES:\nThe full article content is behind a paywall (\"Sign up to read this article for free\"). Therefore, specific details about the nature of the complaints, the timeline, the identity of the outside investigator, the findings, or any official statements from the FDA or Prasad are not available in the provided text.\n\nTERMS (simple explanations):\n*   **CBER:** The Center for Biologics Evaluation and Research, a branch of the FDA that regulates biological products like vaccines, blood products, and cellular therapies.\n*   **Outside investigator:** A third-party individual or firm hired from outside the organization to conduct an independent inquiry."}
{"bucket": "ai_bio", "source": "Endpoints News", "source_type": "rss", "title": "Senate hearing raises FDA-related concerns for new rare disease drugs", "url": "https://endpoints.news/senate-hearing-raises-fda-related-concerns-for-new-rare-disease-drugs/", "one_liner": "Rare disease advocates and senators said they want to see more consistency in the FDA’s approval process during an Aging Committee hearing Thursday that examined how the agency’s regulatory processes have led to delays for ...", "tags": ["biotech", "industry"], "extracted_chars": 1245, "has_fulltext": false, "analysis": "CORE CLAIM:\nSenate hearing raised concerns about the consistency of the FDA's approval process for rare disease drugs. (Note: The article text is truncated; this is the only explicit claim present in the provided snippet).\n\nMETHOD / APPROACH:\nNot stated in source text. The provided text does not describe the methodology of the hearing, any studies presented, or the approach used to examine the FDA's processes.\n\nKEY EVIDENCE:\nNot stated in source text. The provided text does not list any specific evidence, data, case studies, or testimonies presented during the hearing.\n\nWHY IT MATTERS:\nThe FDA's approval process for rare disease drugs (often facilitated by accelerated pathways) directly impacts patient access to treatments for conditions with limited therapeutic options. Concerns about consistency affect regulatory predictability, pharmaceutical development incentives, and patient confidence in approved therapies.\n\nLIMITATIONS / UNCERTAINTIES:\nThe source text is a truncated article preview behind a paywall. It does not contain the full details of the hearing, the specific concerns raised by advocates and senators, the FDA's response, or any proposed solutions. The scope and depth of the discussed issues are unknown from this snippet.\n\nTERMS (simple explanations):\n*   **Rare disease drugs:** Medications developed to treat conditions that affect a small number of people (often defined as fewer than 200,000 people in the U.S.).\n*   **FDA approval process:** The scientific review and regulatory pathway the U.S. Food and Drug Administration uses to determine if a new drug is safe and effective for public use.\n*   **Consistency:** The quality of being uniform, predictable, and applied in the same way over time and across different drug applications."}
{"bucket": "ai_bio", "source": "Endpoints News", "source_type": "rss", "title": "Novartis closes Avidity deal as rare heart disease spinout launches", "url": "https://endpoints.news/novartis-closes-avidity-deal-as-rare-heart-disease-spinout-launches/", "one_liner": "Atrium Therapeutics launched Friday morning as Novartis closed the $12 billion deal to buy Avidity Biosciences and its RNA muscle therapies.\n\n The spinout will take on Avidity’s early-stage programs for genetic cardiomyopathies — heart muscle diseases ...", "tags": ["biotech", "industry"], "extracted_chars": 1433, "has_fulltext": false, "analysis": "CORE CLAIM:\nNovartis completed its $12 billion acquisition of Avidity Biosciences, and simultaneously, a spinout company named Atrium Therapeutics launched with $270 million in funding.\n\nMETHOD / APPROACH:\nNot stated in source text. The article is a brief business news announcement and does not describe a scientific method or research approach.\n\nKEY EVIDENCE:\n- Novartis closed a deal to acquire Avidity Biosciences for $12 billion.\n- Atrium Therapeutics launched as a spinout from this transaction.\n- Atrium Therapeutics secured $270 million in financing at launch.\n- The spinout is associated with \"rare heart disease\" and Avidity's \"RNA muscle therapies.\"\n\nWHY IT MATTERS:\nThis represents a major strategic move by Novartis to acquire a platform (Avidity's RNA muscle therapies) while creating a separate, well-funded entity (Atrium) to pursue a specific therapeutic area (rare heart disease). It highlights a common biopharma strategy of spinning out assets to focus development and mitigate risk.\n\nLIMITATIONS / UNCERTAINTIES:\n- The article is a short news blurb with minimal detail.\n- The specific rare heart disease target, the scientific rationale for the spinout versus the acquisition, and the source of the $270M funding are not explained.\n- No clinical data, trial information, or technical details about the \"RNA muscle therapies\" are provided.\n- The full context is likely behind a paywall.\n\nTERMS (simple explanations):\n- **Spinout:** A new, independent company formed from the assets, technology, or team of an existing organization (often a parent company or a division being sold).\n- **RNA muscle therapies:** Treatments that use RNA-based technologies (like ASOs or siRNA) to target and modify gene expression in muscle tissue.\n- **Rare heart disease:** A cardiac condition affecting a small percentage of the population."}
{"bucket": "protein", "source": "PubMed — Accounts of chemical research", "source_type": "pubmed", "title": "Computational and AI-Driven Ecosystem for Structure-Based Covalent Drug Discovery.", "url": "https://doi.org/10.1021/acs.accounts.5c00905", "one_liner": "ConspectusThe field of covalent drug discovery has witnessed a remarkable resurgence in recent years, a trend underscored by the approval of more than 125 covalent drugs by the US FDA as of 2025, which demonstrates their immense therapeutic potential. Driven by ever-increasing computational power and vast amounts of data, deep learning (DL) is profoundly ...", "tags": ["pubmed", "journal", "biology"], "authors": "Shi Li, Hongyan Du, Xujun Zhang, Hui Zhang, Tingjun Hou, Peichen Pan", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "ai_bio", "source": "Endpoints News", "source_type": "rss", "title": "Protagonist to opt out of Takeda profit-sharing deal, will receive $400M in cash", "url": "https://endpoints.news/protagonist-to-opt-out-of-takeda-profit-sharing-deal-will-receive-400m-in-cash/", "one_liner": "Protagonist Therapeutics will soon receive a significant amount of cash.\n\n Protagonist will opt out of its profit-sharing deal with Takeda on a rare disease drug, the biotech announced Wednesday, entitling it to a one-time  ...", "tags": ["biotech", "industry"], "extracted_chars": 1431, "has_fulltext": false, "analysis": "CORE CLAIM:\nProtagonist Therapeutics will exercise its right to opt out of a profit-sharing agreement with Takeda and, in doing so, will receive a one-time cash payment of $400 million.\n\nMETHOD / APPROACH:\nThe company is utilizing a contractual opt-out provision within its existing profit-sharing deal with Takeda. The specific terms and conditions triggering this opt-out are not detailed in the provided text.\n\nKEY EVIDENCE:\nThe article explicitly states the financial outcome: Protagonist will receive $400 million in cash as a result of opting out. The existence of a profit-sharing deal on a rare disease drug with Takeda is confirmed.\n\nWHY IT MATTERS:\nThis transaction provides Protagonist Therapeutics with a significant, immediate infusion of capital ($400M). It also represents a strategic shift, ending a collaborative financial arrangement with Takeda on a specific drug, likely returning full rights and future revenue potential (and risk) for that drug to Protagonist.\n\nLIMITATIONS / UNCERTAINTIES:\nThe article is a very short news alert. It does not state: the name of the rare disease drug involved; the specific terms of the original profit-sharing deal; the timeline for the payment; the reasons behind Protagonist's decision to opt out; or what strategic plans Protagonist has for the drug post-exit. The source text appears truncated, ending with website navigation and job listings.\n\nTERMS (simple explanations):\n*   **Profit-sharing deal:** A business agreement where two companies share the revenues or profits from a specific product.\n*   **Opt out:** To formally choose to withdraw from or terminate a contractual agreement, often using a pre-defined clause.\n*   **Rare disease drug:** A medication developed to treat a condition that affects a small percentage of the population.\n*   **One-time cash payment:** A single, lump-sum payment of money, as opposed to ongoing royalty or revenue streams."}
{"bucket": "ai_bio", "source": "Endpoints News", "source_type": "rss", "title": "Why did my doctor push Grail’s dubious cancer test?", "url": "https://endpoints.news/why-did-my-doctor-push-grails-dubious-cancer-test/", "one_liner": "Last year, my primary care physician tried to sell me on Grail’s cancer-detecting blood test.\n\n As I approached my 30th birthday, I wanted to start taking better care of my health. A friend recommended a ...", "tags": ["biotech", "industry"], "extracted_chars": 1269, "has_fulltext": false, "analysis": "CORE CLAIM: The author's primary care physician recommended Grail's cancer-detecting blood test, which the article's headline characterizes as \"dubious.\"\nMETHOD / APPROACH: Not stated in source text.\nKEY EVIDENCE: Not stated in source text.\nWHY IT MATTERS: Not stated in source text.\nLIMITATIONS / UNCERTAINTIES: Not stated in source text.\nTERMS (simple explanations): Not stated in source text."}
{"bucket": "ai_bio", "source": "Endpoints News", "source_type": "rss", "title": "AtaiBeckley stock drops on Phase 2a data; Disc to refile rare disease drug", "url": "https://endpoints.news/ataibeckley-stock-drops-on-phase-2a-data-disc-to-refile-rare-disease-drug/", "one_liner": "Plus, news about Boehringer Ingelheim, Sitryx Therapeutics, Argenx, Palvella Therapeutics, Vir Biotechnology, Larimar Therapeutics, Bristol Myers Squibb and SystImmune:\n\n 📉 AtaiBeckley releases Phase 2a data, stock falls: The company", "tags": ["biotech", "industry"], "extracted_chars": 1223, "has_fulltext": false, "analysis": "CORE CLAIM:\nAtaiBeckley's stock declined following the release of Phase 2a clinical trial data for a rare disease drug, and the company (Disc) plans to refile the drug application.\n\nMETHOD / APPROACH:\nNot stated in source text.\n\nKEY EVIDENCE:\nNot stated in source text. The article title indicates negative or disappointing Phase 2a data, but no specific results, metrics, or comparisons are provided.\n\nWHY IT MATTERS:\nA negative clinical trial outcome for a rare disease drug can lead to significant financial loss (stock drop) and requires regulatory re-submission, delaying potential market entry and impacting the company's valuation and pipeline strategy.\n\nLIMITATIONS / UNCERTAINTIES:\nThe source text is a headline and webpage template, not the full article. No data details, trial design, patient population, specific endpoints, or statistical significance are provided. The reason for the refile and the nature of the data issue are unknown.\n\nTERMS (simple explanations):\n*   **Phase 2a:** An early-stage clinical trial to assess safety and get initial signals of a drug's effectiveness in a small group of patients.\n*   **Refile:** To submit a new application to a regulatory agency (like the FDA) after a previous one was rejected, withdrawn, or needed significant updates.\n*   **Rare disease drug:** A medication developed to treat a condition affecting a small population, often with special regulatory pathways and incentives."}
{"bucket": "ai_bio", "source": "Endpoints News", "source_type": "rss", "title": "Novartis to build another radioligand factory; Germany steps up probe into Gerresheimer", "url": "https://endpoints.news/novartis-to-build-another-radioligand-factory-germany-steps-up-probe-into-gerresheimer/", "one_liner": "Novartis is building a new 46,000-square-foot factory in Denton, TX. Construction will start this year and is expected to be operational in 2028. The new facility is a part of its ...", "tags": ["biotech", "industry"], "extracted_chars": 1388, "has_fulltext": false, "analysis": "CORE CLAIM:\nNovartis is building a new 46,000-square-foot radioligand therapy manufacturing factory in Denton, TX, with construction starting in 2026 and expected to become operational later. Separately, German authorities are increasing an investigation into Gerresheimer, a company likely involved in the supply chain for such therapies.\n\nMETHOD / APPROACH:\nNot stated in source text.\n\nKEY EVIDENCE:\nThe article states the factory size (46,000 square feet), location (Denton, TX), and timeline (construction starting in 2026). It also mentions Germany is \"stepping up a probe\" into Gerresheimer but provides no details on the nature of the probe.\n\nWHY IT MATTERS:\nNot stated in source text. (The strategic importance of radioligand therapies and supply chain security is implied by the investment but not explained in the provided text).\n\nLIMITATIONS / UNCERTAINTIES:\nThe full article content is behind a paywall. Key details are missing, including: the specific radioligand therapy(ies) the factory will produce, the investment cost, the exact nature and reason for the German probe into Gerresheimer, and any connection between the two news items.\n\nTERMS (simple explanations):\n*   **Radioligand therapy:** A targeted cancer treatment that combines a molecule that seeks out cancer cells with a radioactive atom that kills them.\n*   **Factory / Manufacturing facility:** A building where drugs are produced at scale.\n*   **Probe / Investigation:** An official examination by authorities into a company's practices or compliance."}
{"bucket": "protein", "source": "PubMed — Current opinion in structural biology", "source_type": "pubmed", "title": "De novo engineering of protein interactions: Retrospective and current advances.", "url": "https://doi.org/10.1016/j.sbi.2026.103240", "one_liner": "New deep learning-based methods for modeling and generation of protein structures have opened a new chapter in the field of protein design, transforming many previously unattainable challenges into routine tasks. Protein-binder design, an important and challenging task in protein engineering, has also experienced significant progress, promising to provide...", "tags": ["pubmed", "journal", "biology"], "authors": "Alisa Khramushin, Evgenia Elizarova, Bruno E Correia", "extracted_chars": 11, "has_fulltext": false, "analysis": "CORE CLAIM:  \nNot stated in source text.\n\nMETHOD / APPROACH:  \nNot stated in source text.\n\nKEY EVIDENCE:  \nNot stated in source text.\n\nWHY IT MATTERS:  \nNot stated in source text.\n\nLIMITATIONS / UNCERTAINTIES:  \nThe provided source text consists only of the word \"Redirecting,\" indicating the DOI link likely leads to a redirection page or the full article content is not accessible in the provided text. No scientific content is available for analysis.\n\nTERMS (simple explanations):  \n- DOI: Digital Object Identifier, a unique string of characters used to identify and locate digital documents (like journal articles) persistently.  \n- Redirecting: The process of automatically sending a user from one web address (URL) to another. In this context, it suggests the DOI link did not directly return the article text."}
{"bucket": "daily", "source": "Quanta Magazine", "source_type": "rss", "title": "Break It To Make It: How Fracturing Sculpts Tissues and Organs", "url": "https://www.quantamagazine.org/break-it-to-make-it-how-fracturing-sculpts-tissues-and-organs-20260227/", "one_liner": "Growing tissues can crack, break, and dissociate to form structures that can later withstand immense forces.            <p>The post <a href=\"https://www.quantamagazine.org/break-it-to-make-it-how-fracturing-sculpts-tissues-and-organs-20260227/\" target=\"_blank\">Break It To Make It: How Fracturing Sculpts Tissues and Organs</a> first appeared on <a href=\"ht...", "tags": ["math", "science"], "extracted_chars": 11566, "has_fulltext": true, "analysis": "CORE CLAIM:\nFracturing, typically viewed as destructive, is a constructive and essential morphogenetic mechanism that actively sculpts tissues and organs during development across diverse organisms, driven by physical forces rather than solely genetic programs.\n\nMETHOD / APPROACH:\nThe article synthesizes findings from a review paper (\"Development,\" Feb 2025) that compiles examples of constructive fractures. It details specific experimental approaches: high-speed, high-resolution live imaging of developing"}
{"bucket": "protein", "source": "PubMed — Journal of economic entomology", "source_type": "pubmed", "title": "Eucalyptus volatiles recognition mechanism of chemosensory protein 5 in Endoclita vietnamensis (Lepidoptera: Hepialidae).", "url": "https://doi.org/10.1093/jee/toag035", "one_liner": "Endoclita vietnamensis (Buchsbaum & Grehan) (Lepidoptera: Hepialidae) is a major stem-boring pest of eucalyptus. Host location in this species is critically dependent on the larval olfactory recognition of eucalyptus volatiles. However, the volatile recognition mechanism of E. vietnamensis remains unclear. To provide a molecular case study on how a key ch...", "tags": ["pubmed", "journal", "biology"], "authors": "Shuai Yuan, Jiaxin Liu, Jintao Lu, Bin Liu, Sijia Wang, Ping Hu", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Proceedings of the National Academy of Sciences of the United States of America", "source_type": "pubmed", "title": "Profile of David Baker, Demis Hassabis, and John Jumper: 2024 Nobel laureates in chemistry.", "url": "https://doi.org/10.1073/pnas.2422539123", "one_liner": "The 2024 Nobel Prize in Chemistry recognized revolutionary computational success in predicting protein structures from amino acid sequences and for designing amino acid sequences that fold into desired protein structures. The ultimate accomplishment emerged principally from two labs, applying distinct approaches, culminating four decades of effort by the ...", "tags": ["pubmed", "journal", "biology"], "authors": "Bonnie Berger, David S Eisenberg", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Accounts of chemical research", "source_type": "pubmed", "title": "Conjugated Oligoelectrolytes as Optical Probes.", "url": "https://doi.org/10.1021/acs.accounts.6c00017", "one_liner": "ConspectusOptical probes are essential tools for interrogating biological and chemical systems invisible to the naked eye, providing insights into molecular interactions, protein activity, and cellular trafficking. Conjugated oligoelectrolytes (COEs), an emerging class of optical probes, are synthetic organic amphiphiles defined by a π-conjugated backbone...", "tags": ["pubmed", "journal", "biology"], "authors": "Samuel J W Chan, Ji-Yu Zhu, Guillermo C Bazan", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — International journal of biological macromolecules", "source_type": "pubmed", "title": "Structural basis of calcium and phosphatidylserine binding annexin V and beyond.", "url": "https://doi.org/10.1016/j.ijbiomac.2026.151076", "one_liner": "Annexins are an important family of proteins that play key roles in crucial biological contexts, sharing the common property of binding membrane phospholipids in a Ca", "tags": ["pubmed", "journal", "biology"], "authors": "Luigi Vitagliano, Alessia Ruggiero, Giuseppe Bifulco, Simone Di Micco", "extracted_chars": 11, "has_fulltext": false, "analysis": "CORE CLAIM:  \nNot stated in source text.\n\nMETHOD / APPROACH:  \nNot stated in source text.\n\nKEY EVIDENCE:  \nNot stated in source text.\n\nWHY IT MATTERS:  \nNot stated in source text.\n\nLIMITATIONS / UNCERTAINTIES:  \nNot stated in source text.\n\nTERMS (simple explanations):  \nNot stated in source text."}
{"bucket": "protein", "source": "PubMed — Glycobiology", "source_type": "pubmed", "title": "Structural Determinants of Site-Specific Core Fucosylation in Human Transferrin: Insights from Crystallography and Molecular Dynamics.", "url": "https://doi.org/10.1093/glycob/cwag013", "one_liner": "Core fucosylation of N-glycans, catalyzed by fucosyltransferase 8 (FUT8), plays a crucial role in various biological processes; however, the structural factors that determine which glycans are site-specifically modified by FUT8 remain poorly understood. Human transferrin carries two N-glycans at Asn432 and Asn630, of which only that at Asn630 is core-fuco...", "tags": ["pubmed", "journal", "biology"], "authors": "Shiho Ohno, Yuki Goto, Noriyoshi Manabe, Yoshiki Yamaguchi", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Microbiology spectrum", "source_type": "pubmed", "title": "A mutation-aware proteomics approach for designing a multi-epitope vaccine against multidrug-resistant", "url": "https://doi.org/10.1128/spectrum.03095-25", "one_liner": "UNLABELLED: The increasing prevalence of multidrug-resistant IMPORTANCE: Multidrug resistance has become a common phenomenon leading to difficulty in infection control. No options are left to treat such infections after the emergence of colistin resistance. Therefore, this approach to developing multi-epitope therapeutic vaccines is very promising to face...", "tags": ["pubmed", "journal", "biology"], "authors": "Gul Afshan, Namrah Yaseen, Asad U Khan", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Ecology and evolution", "source_type": "pubmed", "title": "Mechanism of Dietary Variation of Grazing Yaks on Tibetan Plateau: The Role of Seasonal Heterogeneity of Resources.", "url": "https://doi.org/10.1002/ece3.73132", "one_liner": "Diet composition is a crucial yet understudied, dimension of animal ecology, with seasonal dietary shifts being a key factor in the population dynamics of large herbivores. However, characterizing these variations and their drivers in free-ranging animals has been challenging due to their high mobility and the diverse plant species in their diet. Accordin...", "tags": ["pubmed", "journal", "biology"], "authors": "Yuning Ru, Yang Liu, A Allan Degen, Fuyu Shi, Qunying Zhang, Shuai Zheng, Mengyuan Xu, Dehua Wang, Qiang Zhang, Na Guo", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Journal of biomolecular structure & dynamics", "source_type": "pubmed", "title": "How do AI ensemble pipelines treat disorder? A head-to-head comparison on α-synuclein.", "url": "https://doi.org/10.1080/07391102.2026.2630328", "one_liner": "Intrinsically disordered proteins (IDPs) play central roles in signalling, regulation, and disease, yet they remain a severe challenge for current artificial intelligence models of protein structure. Most methods were trained on ordered, single structure data and optimize objectives that implicitly favour compact, well-folded conformations. IDPs, by contr...", "tags": ["pubmed", "journal", "biology"], "authors": "Orkid Coskuner-Weber, Fatma Irem Akkum, Sule Irem Caglayan, Ibrahim Yagiz Akbayrak, Vladimir N Uversky, Sinan Eyuboglu", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Journal of cheminformatics", "source_type": "pubmed", "title": "Graph-based transformer to predict the octanol-water partition coefficient.", "url": "https://doi.org/10.1186/s13321-026-01160-2", "one_liner": "Lipophilicity is a fundamental physicochemical property that significantly influences various aspects of drug behavior, such as solubility, permeability, metabolism, distribution, protein binding, and excretion. Consequently, accurate prediction of this property is critical for the successful discovery and development of new drug candidates. The classical...", "tags": ["pubmed", "journal", "biology"], "authors": "Vyacheslav Grigorev, Nikita Serov, Timur Gimadiev, Assima Poyezzhayeva, Pavel Sidorov", "extracted_chars": 3252, "has_fulltext": true, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Molecular diversity", "source_type": "pubmed", "title": "GRU-based de novo design and in-silico prioritization of EZH2 inhibitors.", "url": "https://doi.org/10.1007/s11030-026-11481-x", "one_liner": "EZH2 (Enhancer-Homozygous Protein 2), as a key epigenetic regulator, is closely associated with multiple cancers. Consequently, the design of EZH2-targeting inhibitors has become a significant focus in drug development. The application of deep learning methods in the chemical field can accelerate the process of discovering new molecules. This study utiliz...", "tags": ["pubmed", "journal", "biology"], "authors": "Na Yu, Maoqi Wang, Xiaodie Chen, Rong Liu, Liang Zou, Mao Shu", "extracted_chars": 7514, "has_fulltext": true, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Journal of the science of food and agriculture", "source_type": "pubmed", "title": "Recent insights for fish allergens: novel processing techniques and detection technology.", "url": "https://doi.org/10.1002/jsfa.70534", "one_liner": "Fish allergy is a common food-related allergic reaction that can lead to serious health issues and poses a significant challenge to global food safety. To facilitate a clear understanding of risk prevention and control for fish allergy, we provide a comprehensive overview of the mechanism underlying fish allergy and the properties of fish allergens, with ...", "tags": ["pubmed", "journal", "biology"], "authors": "Hailin Yin, Xinyu Ge, Futeng Song, Qingli Yang, Liangtao Lv", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Antonie van Leeuwenhoek", "source_type": "pubmed", "title": "In silico structural and dynamic stability analysis of an endo-1,4-β-xylanase from Agrobacterium sp. strain DKPNP3, isolated from the gut of Gonocephalum sp.", "url": "https://doi.org/10.1007/s10482-026-02271-4", "one_liner": "Xylanases are one of the most important hydrolytic enzymes involved in plant hemicellulose degradation with potential industrial as well as ecological significance. This study presents a comprehensive characterization of an endo-1,4-β-xylanase enzyme from Agrobacterium sp. Strain DKPNP3 isolated from the beetle gut of Gonocephalum sp. (Coleoptera: Tenebri...", "tags": ["pubmed", "journal", "biology"], "authors": "Debabrata Karmakar, Pradipta Saha", "extracted_chars": 12140, "has_fulltext": true, "analysis": ""}
{"bucket": "protein", "source": "PubMed — The Journal of biological chemistry", "source_type": "pubmed", "title": "Stability and interaction defects in the Sin3A PAH1 αα-hub domain associated with loss of function variants.", "url": "https://doi.org/10.1016/j.jbc.2026.111312", "one_liner": "Hub proteins organize large interactomes using their hub domains for protein-protein interactions. αα-hub domains are present in transcriptional regulators such as Sin3A, an integral scaffolding protein of histone deacetylation complexes. Here, we relate αα-hub stability to function by structural and thermodynamic studies of the Sin3A-PAH1 wild-type hub d...", "tags": ["pubmed", "journal", "biology"], "authors": "Amanda D Due, Sigrid Jørsboe, Louise T Jensen, Charlotte O'Shea, Majken Staulund, Martin Willemoës, Birthe B Kragelund, Ida M Z Sjøgaard, Karen Skriver", "extracted_chars": 11, "has_fulltext": false, "analysis": "CORE CLAIM:\nNot stated in source text.\n\nMETHOD / APPROACH:\nNot stated in source text.\n\nKEY EVIDENCE:\nNot stated in source text.\n\nWHY IT MATTERS:\nNot stated in source text.\n\nLIMITATIONS / UNCERTAINTIES:\nNot stated in source text.\n\nTERMS (simple explanations):\nNot stated in source text."}
{"bucket": "protein", "source": "PubMed — Computers in biology and medicine", "source_type": "pubmed", "title": "GraphUnet-SS: A novel deep learning model for protein secondary structure prediction based on U-Net architecture.", "url": "https://doi.org/10.1016/j.compbiomed.2026.111598", "one_liner": "Prediction of the 3-D structure of a protein, which can be used to determine its function, is one of the most challenging problems in the bioinformatics field. Protein secondary structure prediction (PSSP) is a crucial step for protein 3-D structure prediction. Recent studies that focused on deep learning methods obtained significant improvements in PSSP....", "tags": ["pubmed", "journal", "biology"], "authors": "Yasin Görmez, Mostafa Sabzekar, Zafer Aydin", "extracted_chars": 11, "has_fulltext": false, "analysis": "CORE CLAIM:\nNot stated in source text.\n\nMETHOD / APPROACH:\nNot stated in source text.\n\nKEY EVIDENCE:\nNot stated in source text.\n\nWHY IT MATTERS:\nNot stated in source text.\n\nLIMITATIONS / UNCERTAINTIES:\nNot stated in source text.\n\nTERMS (simple explanations):\nNot stated in source text."}
{"bucket": "protein", "source": "PubMed — Biophysical journal", "source_type": "pubmed", "title": "Mechanism of MEK1 activation by phosphorylation.", "url": "https://doi.org/10.1016/j.bpj.2026.02.033", "one_liner": "Phosphorylation is the most common post-translational protein modification, often acting as the activator of protein function. In the case of MEK1, a member of the MAP kinase family, phosphorylation of both S218 and S222 are necessary for activation. Yet the molecular activation mechanism and its cooperative nature are poorly understood, especially due to...", "tags": ["pubmed", "journal", "biology"], "authors": "Everett Jin, Levent Sari, Milo M Lin", "extracted_chars": 11, "has_fulltext": false, "analysis": "CORE CLAIM:\nNot stated in source text.\n\nMETHOD / APPROACH:\nNot stated in source text.\n\nKEY EVIDENCE:\nNot stated in source text.\n\nWHY IT MATTERS:\nNot stated in source text.\n\nLIMITATIONS / UNCERTAINTIES:\nNot stated in source text.\n\nTERMS (simple explanations):\nNot stated in source text."}
{"bucket": "protein", "source": "PubMed — Scientific reports", "source_type": "pubmed", "title": "Design, synthesis, and experimental evaluation of rupestonic acid derivatives as novel anti-tumor agents guided by network pharmacology and molecular docking.", "url": "https://doi.org/10.1038/s41598-026-39442-2", "one_liner": "This integrated study elucidates the antitumor potential of Artemisia rupestris L.'s primary bioactive component, rupestonic acid (RA), and advances a superior derivative through a systematic, multi-stage strategy. The investigation commenced with network pharmacology, which predicted RA's polypharmacology mechanism by associating it with 55 potential can...", "tags": ["pubmed", "journal", "biology"], "authors": "Abdulla Yusuf, Qiaerbati Adelibieke, Erkin Tursun, Zhang Yucai, Qi Shining, Linzhen Hu, Maierdanjiang Aierken, Abulikemu Aobuli, Abulimiti Yumaier, Adila Abudurexiti", "extracted_chars": 10676, "has_fulltext": true, "analysis": "CORE CLAIM:  \nNot stated in source text. The provided input is a bibliography/reference list, not an article text containing a specific claim.\n\nMETHOD / APPROACH:  \nNot stated in source text. No article methodology is described in the provided bibliography.\n\nKEY EVIDENCE:  \nNot stated in source text. The input consists solely of citation metadata (authors, titles, journals, years) for multiple distinct publications, not the content or results of a single study.\n\nWHY IT MATTERS:  \nNot stated in source text. The significance of any specific research finding cannot be determined from a list of references alone.\n\nLIMITATIONS / UNCERTAINTIES:  \nNot stated in source text. No study limitations are presented in the provided citation list.\n\nTERMS (simple explanations):  \n*   **GLOBOCAN:** A global cancer surveillance project that estimates cancer incidence and mortality worldwide.\n*   **Traditional Chinese Medicine (TCM):** A system of medicine that includes various practices like herbal remedies, often used as complementary therapy.\n*   **Rupestonic acid:** A natural compound isolated from the plant *Artemisia rupestris*, studied for potential antiviral and cytotoxic (anti-cancer) properties.\n*   **Adjuvant therapy:** Additional treatment given alongside a primary therapy (like chemotherapy) to increase its effectiveness.\n*   **Derivative (chemistry):** A compound created from another compound by chemical modification.\n*   **In vitro:** Experiments conducted in a controlled environment outside a living organism, e.g., in a petri dish.\n*   **Molecular docking / Pharmacophore modeling:** Computational methods used to predict how a small molecule (like a drug candidate) interacts with a target protein.\n*   **PI3K/AKT pathway:** A critical cellular signaling pathway involved in growth, survival, and metabolism, often dysregulated in cancer.\n*   **Heme oxygenase-1 (HO-1):** An enzyme with antioxidant and anti-inflammatory properties, sometimes induced by antiviral agents.\n*   **Interferon response:** A key part of the body's innate immune defense against viral infections.\n*   **ADMET:** An acronym for Absorption, Distribution, Metabolism, Excretion, and Toxicity—key properties evaluated for drug candidates.\n*   **QSAR:** Quantitative Structure-Activity Relationship; computational methods linking a molecule's chemical structure to its biological activity.\n*   **Hybrid drug:** A single chemical entity designed to target multiple biological pathways or proteins simultaneously."}
{"bucket": "protein", "source": "PubMed — Computer methods in biomechanics and biomedical engineering", "source_type": "pubmed", "title": "Deep contrastive learning method for drug-target interactions prediction.", "url": "https://doi.org/10.1080/10255842.2026.2635031", "one_liner": "Accurate prediction of drug-target interactions (DTI) is critical for accelerating drug discovery. In this study, we propose deep contrastive learning (DeepCL), a novel deep contrastive learning framework that significantly improves DTI prediction accuracy, particularly in low-coverage scenarios. Unlike traditional methods, DeepCL introduces a generalized...", "tags": ["pubmed", "journal", "biology"], "authors": "Jinlong Li, Shusen Zhou, Tong Liu, Chanjuan Liu, Mujun Zang, Qingjun Wang", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — American journal of medical genetics. Part A", "source_type": "pubmed", "title": "KRT6A Variant Underlies Pachyonychia Congenita: Insights Into Protein Aggregation and PPAR Signaling.", "url": "https://doi.org/10.1002/ajmg.a.70091", "one_liner": "Variants in the keratin 6A (KRT6A) gene are a major cause of pachyonychia congenita (PC), a rare autosomal dominant disorder characterized by nail hypertrophy and other ectodermal abnormalities. This study aimed to identify the causative mutation in a PC family and investigate the underlying pathogenic mechanism. We performed exome sequencing on this PC p...", "tags": ["pubmed", "journal", "biology"], "authors": "Yaqiong Ren, Wensi Niu, Yue Cao, Yuan Zhang, Jun Hua, Hongying Wang", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Current opinion in structural biology", "source_type": "pubmed", "title": "Graph neural networks for molecular dynamics simulations.", "url": "https://doi.org/10.1016/j.sbi.2026.103238", "one_liner": "Graph neural networks (GNNs) are emerging as powerful tools for advancing molecular dynamics (MD) simulations, providing data-driven frameworks to complement traditional physics-based approaches. By representing atoms and their interactions as graphs, GNNs naturally encode chemical and structural information, enabling accurate neural network force fields ...", "tags": ["pubmed", "journal", "biology"], "authors": "Mohd Ahsan, Chinmai Pindi, Souvik Sinha, Amun C Patel, Giulia Palermo", "extracted_chars": 11, "has_fulltext": false, "analysis": "CORE CLAIM:\nNot stated in source text.\n\nMETHOD / APPROACH:\nNot stated in source text.\n\nKEY EVIDENCE:\nNot stated in source text.\n\nWHY IT MATTERS:\nNot stated in source text.\n\nLIMITATIONS / UNCERTAINTIES:\nNot stated in source text.\n\nTERMS (simple explanations):\nNot stated in source text."}
{"bucket": "protein", "source": "PubMed — Molecular biology reports", "source_type": "pubmed", "title": "Mechanisms of angiopoietin-like protein 7 regulation and therapeutic potential in tumors.", "url": "https://doi.org/10.1007/s11033-025-11404-3", "one_liner": "Angiopoietin-like 7 (ANGPTL7) is a member of the angiopoietin-like protein family, which plays critical physiological roles in angiogenesis, tissue homeostasis maintenance, inflammatory signaling, glucose metabolism and lipid metabolism. Meanwhile, ANGPTL7 is also implicated in the regulation of numerous pathological processes and disease development. In ...", "tags": ["pubmed", "journal", "biology"], "authors": "Xiaoxiao Fan, Wenxin Zheng, Xianglong Tian, Xiaolin Wu", "extracted_chars": 11575, "has_fulltext": true, "analysis": "CORE CLAIM: Not stated in source text. The provided input is a list of article citations/references, not the full text of a single article to analyze.\nMETHOD / APPROACH: Not stated in source text.\nKEY EVIDENCE: Not stated in source text.\nWHY IT MATTERS: Not stated in source text.\nLIMITATIONS / UNCERTAINTIES: Not stated in source text.\nTERMS (simple explanations): Not stated in source text."}
{"bucket": "protein", "source": "PubMed — Antonie van Leeuwenhoek", "source_type": "pubmed", "title": "Leptospira interrogans HtrA protease is a potent inducer of multifaceted cellular responses.", "url": "https://doi.org/10.1007/s10482-026-02270-5", "one_liner": "Leptospirosis, a bacterial zoonosis caused by select pathogenic spirochetes belonging to the genus Leptospira, can trigger a systemic inflammatory response syndrome due to a cytokine storm that can occur during infection. However, the molecular mechanisms underlying the extensive inflammatory responses during leptospiral infection remain poorly understood...", "tags": ["pubmed", "journal", "biology"], "authors": "Huizhen Tian, Xiaofei Tao, Niya Hu, Yanling Liu, Yuting Li, Li Zhou, Lingbing Zeng", "extracted_chars": 19995, "has_fulltext": true, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Science advances", "source_type": "pubmed", "title": "Diverse database and machine learning model to narrow the generalization gap in RNA structure prediction.", "url": "https://doi.org/10.1126/sciadv.adz4967", "one_liner": "Understanding macromolecular structures of proteins and nucleic acids is critical for discerning their functions and biological roles. Advanced techniques-crystallography, nuclear magnetic resonance, and cryo-electron microscopy-have facilitated the determination of more than 180,000 protein structures, all cataloged in the Protein Data Bank. This compreh...", "tags": ["pubmed", "journal", "biology"], "authors": "Albéric A de Lajarte, Yves J Martin des Taillades, Justin Aruda, Pierre Bongrand, Federico Fuchs Wightman, Dragui Salazar, Matthew F Allan, Colin Kalicki, Casper L'Esperance-Kerckhoff, Alex Kashi, Fabrice Jossinet, Silvi Rouskin", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Communications chemistry", "source_type": "pubmed", "title": "Disentangling coevolutionary constraints for modeling protein conformational heterogeneity.", "url": "https://doi.org/10.1038/s42004-026-01940-9", "one_liner": "Accurate characterization of multi-state protein conformations is crucial for understanding their functional mechanisms and advancing targeted therapies. Extracting coevolutionary constraints from homologous sequences helps reveal protein structure and function, which can be automatically captured by MSA Transformer leveraging attention mechanisms. Making...", "tags": ["pubmed", "journal", "biology"], "authors": "Shimian Li, Chengwei Zhang, Lupeng Kong, Yue Xue, Sirui Liu, Yi Qin Gao", "extracted_chars": 13101, "has_fulltext": true, "analysis": "CORE CLAIM:  \nNot stated in source text. The provided input is a bibliography/reference list, not an article with a core claim.\n\nMETHOD / APPROACH:  \nNot stated in source text. The provided input is a bibliography/reference list, not an article describing a method or approach.\n\nKEY EVIDENCE:  \nNot stated in source text. The provided input is a bibliography/reference list, not an article presenting evidence.\n\nWHY IT MATTERS:  \nNot stated in source text. The provided input is a bibliography/reference list, not an article explaining significance.\n\nLIMITATIONS / UNCERTAINTIES:  \nNot stated in source text. The provided input is a bibliography/reference list, not an article discussing limitations.\n\nTERMS (simple explanations):  \nNot stated in source text. The provided input is a bibliography/reference list, not an article defining terms."}
{"bucket": "protein", "source": "PubMed — Scientific data", "source_type": "pubmed", "title": "Chromosome-level genome of the bank vole (Clethrionomys glareolus): a resource for eco-evo-disease research.", "url": "https://doi.org/10.1038/s41597-026-06924-x", "one_liner": "The increasing availability of reference genomes for non-traditional model species is enhancing research in ecology and evolution. Here, we present a high-quality chromosome-level genome assembly and annotation for the bank vole Clethrionomys glareolus, an emerging model mammal. The 2.24 Gb assembly is resolved into 28 chromosome-scale scaffolds, consiste...", "tags": ["pubmed", "journal", "biology"], "authors": "Silvia Marková, Thomas A White, Jeremy B Searle, Petr Kotlík", "extracted_chars": 7925, "has_fulltext": true, "analysis": "CORE CLAIM:\nA high-quality, chromosome-level reference genome has been assembled and annotated for the bank vole (*Clethrionomys glareolus*), providing a foundational genomic resource for research in ecology, evolution, and disease (eco-evo-disease research).\n\nMETHOD / APPROACH:\nThe genome was generated using a combination of sequencing and assembly technologies: Illumina short reads for the primary assembly, PacBio HiFi long reads for error correction and gap filling, and Hi-C chromatin conformation capture data for chromosome-scale scaffolding. Annotation was performed using a combination of evidence-driven (RNA-seq, protein homology) and ab initio prediction pipelines, with completeness assessed using BUSCO.\n\nKEY EVIDENCE:\n*   The assembly is chromosome-level, with 25 chromosomes (2n=50) resolved.\n*   Genome completeness is high, with a BUSCO score of 97.5% for mammalian single-copy orthologs.\n*   The annotation includes predicted protein-coding genes, supported by RNA-seq data from multiple tissues and homology to known proteins in UniProt/GENCODE.\n*   The genome and associated data are publicly available in GenBank (assembly accession GCA_055000105.1) and figshare.\n\nWHY IT MATTERS:\nThe bank vole is a key non-model organism for studying adaptive phylogeography, climate change responses, and zoonotic disease (e.g., hantaviruses). A high-quality reference genome enables:\n1.  Population genomic studies to understand historical demography and local adaptation.\n2.  Functional genomic analyses linking genetic variation to phenotypic traits (e.g., climate adaptation, parasite resistance).\n3.  Comparative genomics across rodent species.\n4.  Improved assembly and annotation of mitochondrial genomes (as shown in prior bank vole studies).\n\nLIMITATIONS / UNCERTAINTIES:\nNot stated in source text. The provided references describe the resource's creation and potential applications but do not detail specific limitations of the assembly or annotation.\n\nTERMS (simple explanations):\n*   **Chromosome-level genome:** A genome assembly where sequences are ordered and oriented to correspond to the organism's actual chromosomes.\n*   **BUSCO:** A tool that measures how complete a genome assembly is by checking for the presence of a set of standard, single-copy genes expected in a given lineage.\n*   **Annotation:** The process of identifying the locations and functions of genes and other functional elements in a genome sequence.\n*   **Eco-evo-disease research:** Research integrating ecology, evolution, and disease biology to understand how organisms adapt to their environment and interact with pathogens.\n*   **Non-model organism:** A species that is not one of the traditional few (like mouse, fruit fly, yeast) with extensive genetic tools and community resources, but is studied for specific ecological or evolutionary questions"}
{"bucket": "protein", "source": "PubMed — Cancer immunology research", "source_type": "pubmed", "title": "Intra-tumoral tertiary lymphoid structures characterized by a B cell-related signature elicit antitumor effect through HAPLN3 in hepatocellular carcinoma.", "url": "https://doi.org/10.1158/2326-6066.CIR-25-0758", "one_liner": "The existence of intra-tumoral tertiary lymphoid structures (TLSs) has been reported to be correlated with reduced recurrence of hepatocellular carcinoma (HCC). However, the cellular characteristics and driving mechanism of TLSs in HCC remain largely unknown. In this study, we compared clinical outcomes of TLSs in HCC using whole exome sequencing, bulk RN...", "tags": ["pubmed", "journal", "biology"], "authors": "Qianwen Zeng, Yujun Liu, Jingying Chen, Qiaoyi Chen, Zebin Chen, Liting Peng, Zhijuan Li, Kai Lei, Xiaoxuan Lin, Shijia Liu, Ruiyan Xuan, Ruiming Liang, Zhihang Chen, Chuankai Zhang, Changyi Liao, Youmei Kang, Tianhong Su, Shuling Chen, Ming Kuang, Junbin Liao, Jianping Guo, Li Tan", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Journal of bacteriology", "source_type": "pubmed", "title": "An N4-like", "url": "https://doi.org/10.1128/jb.00488-25", "one_liner": "", "tags": ["pubmed", "journal", "biology"], "authors": "Maeve McLaughlin, Katheren Barger, Charlotte Barron, Makena Fisher, Larissa Kohn, Priscilla Mac-Kittah, Aretha Fiebig, Sean Crosson", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Critical reviews in food science and nutrition", "source_type": "pubmed", "title": "Microbial fermentation of cereals: nutritional, techno-functional, and compositional transformations toward data-driven process optimization.", "url": "https://doi.org/10.1080/10408398.2026.2632148", "one_liner": "Cereal fermentation represents a cornerstone of food bioprocessing that transforms staple grains into nutrient-dense, functionally enhanced ingredients. This review consolidates evidence on the ways in which microbial fermentation by bacteria, yeasts, and filamentous fungi alters the compositional, nutritional, and techno-functional properties of cereals....", "tags": ["pubmed", "journal", "biology"], "authors": "Yufeng Lin, Emad Karrar, Shahidul Islam, Zhao Jin, Usman Muhammad, Minwei Xu", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Nature", "source_type": "pubmed", "title": "Convergent MurJ flippase inhibition by phage lysis proteins.", "url": "https://doi.org/10.1038/s41586-026-10163-w", "one_liner": "Antimicrobial drug resistance poses a global health challenge that necessitates the identification of new druggable targets", "tags": ["pubmed", "journal", "biology"], "authors": "Yancheng E Li, S Francesca Antillon, Grace F Baron, Karthik Chamakura, Ry Young, William M Clemons", "extracted_chars": 7838, "has_fulltext": true, "analysis": "CORE CLAIM: Not stated in source text.\nMETHOD / APPROACH: Not stated in source text.\nKEY EVIDENCE: Not stated in source text.\nWHY IT MATTERS: Not stated in source text.\nLIMITATIONS / UNCERTAINTIES: Not stated in source text.\nTERMS (simple explanations): Not stated in source text."}
{"bucket": "protein", "source": "PubMed — Chembiochem : a European journal of chemical biology", "source_type": "pubmed", "title": "Folding Thermodynamics and Kinetics of the N-Terminal Domain of the Circadian Clock-Regulated Histidine Kinase SasA.", "url": "https://doi.org/10.1002/cbic.202500919", "one_liner": "Despite groundbreaking advancements in protein structure prediction, particularly with AlphaFold2/3 and RoseTTAFold, the protein folding problem remains elusive. In this study, we investigate the folding kinetics of the N-terminal thioredoxin-like domain of histidine kinase SasA (N-SasA), a key component of the two-component regulatory system of the cyano...", "tags": ["pubmed", "journal", "biology"], "authors": "Buyuan Ma, Sainan Li, Zengxin Ma, Ning Zhang", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — The Journal of chemical physics", "source_type": "pubmed", "title": "Shedding light on reactive sulfur species coordination to metmyoglobin by QM-MM TD-DFT simulations.", "url": "https://doi.org/10.1063/5.0316470", "one_liner": "Understanding how sulfur-containing ligands modulate the structure, electronic configuration, and spectroscopy of ferric heme proteins is essential for interpreting their reactivity and assigning experimentally observed intermediates. Here, we investigated the spectroscopic properties of a series of ferric myoglobin species, MbFe(III)-X, being X = HS-, S2...", "tags": ["pubmed", "journal", "biology"], "authors": "Melisa Carllinni Colombo, Andresa Messias, Darío A Estrin, Sara E Bari, Juan P Marcolongo", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — PloS one", "source_type": "pubmed", "title": "Designing a novel vaccine against COVID-19 based on spike SARS-Cov-2 notable mutations using immunoinformatics approaches.", "url": "https://doi.org/10.1371/journal.pone.0334662", "one_liner": "The rapid emergence of SARS-CoV-2 variants with spike protein mutations undermines the effectiveness of current vaccines, necessitating innovative strategies to ensure broad and lasting immunity. This study leverages an immunoinformatics approach to design two multi-epitope vaccine constructs Cov19-B (649 amino acids, 74 kDa) and Cov19-T (465 amino acids,...", "tags": ["pubmed", "journal", "biology"], "authors": "Somayyeh Rahimnahal, Shahnaz Yousefizadeh, Yahya Mohammadi", "extracted_chars": 100000, "has_fulltext": true, "analysis": "CORE CLAIM:\nThis study computationally designed two multi-epitope vaccine constructs (Cov19-B and Cov19-T) targeting conserved and mutation-derived epitopes from the SARS-CoV-2 spike protein of the Alpha, Beta, Gamma, and Omicron variants, aiming to elicit broad humoral and cellular immunity against evolving strains.\n\nMETHOD / APPROACH:\nAn immunoinformatics"}
{"bucket": "protein", "source": "PubMed — Journal of medicinal chemistry", "source_type": "pubmed", "title": "Mechanistic Insights into G Protein-Biased κ-Opioid Receptor Signaling Using Dual-Charged Naltrexamine Amides.", "url": "https://doi.org/10.1021/acs.jmedchem.5c02135", "one_liner": "Opioids remain a cornerstone of pain management, but currently used therapeutics are associated with serious side effects. While κ-opioid receptor (KOR) agonists offer an alternative to classical μ-opioid receptor (MOR) agonists, their clinical potential is limited by severe adverse effects. G protein-biased KOR agonists are a promising strategy for devel...", "tags": ["pubmed", "journal", "biology"], "authors": "Niklas Piet Doering, Kristina Puls, Marta Diceglie, Anja Meraner, Axel Hentsch, Siriwat Hongnak, Armin Wurzer, Helmut Schmidhammer, Mariana Spetea, Marc Nazare, Gerhard Wolber", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Journal of medicinal chemistry", "source_type": "pubmed", "title": "Drug Repurposing: Conversion of the Peripherally Restricted HIV Protease Inhibitor Amprenavir to Potent, Selective, and CNS-Penetrant Agonists for the Cannabinoid Receptor 2.", "url": "https://doi.org/10.1021/acs.jmedchem.5c02796", "one_liner": "Herein, we report the identification of the HIV protease inhibitor amprenavir as a selective cannabinoid receptor 2 (CB", "tags": ["pubmed", "journal", "biology"], "authors": "Daniel H Haymer, Renn A Duncan, Alice L Rodriguez, Allie Han, Richard J Lindsay, N Kithmini Wijesiri, Analisa Thompson Gray, Srinivasan Krishnan, Aidong Qi, Benjamin P Brown, Olivier Boutaud, Darren W Engers, Carrie K Jones, Colleen M Niswender, Craig W Lindsley, Aaron M Bender", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Journal of chemical information and modeling", "source_type": "pubmed", "title": "Protein Language Model Embeddings Distinguish Catalytic from Structural Zinc-Binding Sites with Interpretable Attention Signatures.", "url": "https://doi.org/10.1021/acs.jcim.5c03142", "one_liner": "Zinc ions serve dual roles in proteins: as catalytic cofactors and as structural elements. Distinguishing these functional classes from sequence alone remains challenging, because both share similar coordination geometries. Here, we demonstrate that ESM-2 embeddings encode sufficient information to classify catalytic versus structural zinc sites with high...", "tags": ["pubmed", "journal", "biology"], "authors": "Karen Sargsyan", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Molecular biology reports", "source_type": "pubmed", "title": "Isolation and characterization of a novel phage AbT1 and evaluating its anti-biofilm activity and antibiotic synergy.", "url": "https://doi.org/10.1007/s11033-026-11608-1", "one_liner": "BACKGROUND: Acinetobacter baumannii is a formidable multidrug-resistant pathogen prevalent in healthcare settings. Amid the escalating challenge of antimicrobial resistance, phage therapy has regained significant attention. This approach harnesses the natural predatory ability of bacteriophages to combat bacterial infections. METHODS AND RESULTS: A novel ...", "tags": ["pubmed", "journal", "biology"], "authors": "Xiaoxiao Li, Jiaxin Liu, Haoyu Li, Wanlian Zhang, Hanqi Wei, Shihao Song, Xiangxiu Chen", "extracted_chars": 12126, "has_fulltext": true, "analysis": "CORE CLAIM:\nBacteriophages (phages) and phage-derived enzymes (e.g., depolymerases) show significant promise as therapeutic agents against multidrug-resistant (MDR) *Acinetobacter baumannii*, including in combination with antibiotics and for disrupting biofilms.\n\nMETHOD / APPROACH:\nThe collective research involves: 1) Isolation and characterization of novel *A. baumannii*-specific lytic phages from environmental sources (e.g., sewage). 2) Genomic analysis of phages to assess safety (absence of virulence/lysogeny genes) and identify therapeutic genes (e.g., depolymerases). 3) *In vitro* testing of phage efficacy against planktonic and biofilm cultures of MDR *A. baumannii*. 4) Evaluation of phage-antibiotic synergy (PAS) in *in vitro* models and in vivo using the *Galleria mellonella* infection model and human heat-inactivated plasma. 5) Stability testing of phages under various conditions. 6) Development and testing of phage cocktails to broaden host range and prevent resistance.\n\nKEY EVIDENCE:\n*   Novel phages (e.g., vB_AbaP_AGC01, vB_AbaM_AB4P2) from various families (e.g., *Autographiviridae*, *Myoviridae*, *Siphoviridae*, *Friunavirus*) efficiently lyse MDR *A. baumannii* strains.\n*   Phages encoding depolymerases (e.g., from phage vB_AbaM_AB4P2, φAB6) can degrade bacterial capsules and biofilms.\n*   Phage-antibiotic combinations (e.g., phage with tigecycline, meropenem) demonstrate synergistic effects, reducing bacterial load more effectively than either treatment alone in *in vitro* and *G. mellonella* models.\n*   Phage cocktails can control the development of phage resistance and target a broader range of *A. baumannii* clones.\n*   Phages remain stable under various pH and temperature conditions, supporting potential therapeutic use.\n\nWHY IT MATTERS:\n*Acinetobacter baumannii* is a critical WHO priority pathogen due to its pervasive multidrug resistance, particularly to carbapenems, and its ability to persist on hospital surfaces and form resilient biofilms, causing difficult-to-treat nosocomial infections. Phage therapy represents a vital, non-antibiotic strategy to combat this global health menace, offering a potential solution where conventional antibiotics fail.\n\nLIMITATIONS / UNCERTAINTIES:\n*   Most efficacy data is from *in vitro* and invertebrate (*G. mellonella*) models; robust mammalian (e.g., murine) and ultimately human clinical trial data are limited.\n*   The regulatory pathway for phage therapy is complex and not yet standardized globally.\n*   Phage resistance can still emerge, though cocktails may mitigate this.\n*   Host immune responses to administered phages (neutralizing antibodies, inflammatory reactions) are a significant uncertainty for systemic applications"}
{"bucket": "protein", "source": "PubMed — PloS one", "source_type": "pubmed", "title": "A novel mRNA-based multiepitope vaccine candidate against Cryptosporidium hominis and Cryptosporidium parvum employing reverse-vaccinology and immunoinformatics approaches.", "url": "https://doi.org/10.1371/journal.pone.0343643", "one_liner": "INTRODUCTION: The parasite Cryptosporidium spp. causes cryptosporidiosis, a diarrheal disease in humans and animals. This study describes the development of mRNA vaccine targeting antigens from C. hominis and C. parvum, important gut pathogens. This vaccine was designed with reverse vaccinology and immunoinformatics as no FDA-approved vaccine exists for c...", "tags": ["pubmed", "journal", "biology"], "authors": "Ahmad Abdullah Mahdeen, Imam Hossain, Md Habib Ullah Masum, T M Fazla Rabbi, Sajedul Islam", "extracted_chars": 77780, "has_fulltext": true, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Blood", "source_type": "pubmed", "title": "Differential role of CREBBP missense and truncating mutations in germinal center development and lymphomagenesis.", "url": "https://doi.org/10.1182/blood.2025031181", "one_liner": "Truncating and missense mutations of the CREBBP gene are highly prevalent in follicular lymphoma (FL) and diffuse large B cell lymphoma (DLBCL), the most common lymphoid malignancies. These mutations are acquired early during tumor evolution by a common precursor cell (CPC) and lead to either complete protein loss or single amino-acid substitutions in the...", "tags": ["pubmed", "journal", "biology"], "authors": "Chuanjiang Yu, Mara Holloman, Andrew Kim, Yunchao Chang, Stefanie Meyer, Antony B Holmes, Bowen Cai, Tongwei Mo, Katia Basso, Kostiantyn Dreval, Ryan D Morin, Govind Bhagat, Charles G Mullighan, Riccardo Dalla-Favera, Laura Pasqualucci", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — mBio", "source_type": "pubmed", "title": "Type VIIb secretion system recruits the dedicated cell wall hydrolase EssH to enable effector secretion by", "url": "https://doi.org/10.1128/mbio.03196-25", "one_liner": "", "tags": ["pubmed", "journal", "biology"], "authors": "Richard Agyen, Isabelle Powell, Mahalia McNair, Dominique Missiakas, Maksym Bobrovskyy", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Quarterly reviews of biophysics", "source_type": "pubmed", "title": "Revealing protein dynamics with high-pressure NMR.", "url": "https://doi.org/10.1017/S0033583526100092", "one_liner": "While the structure of proteins can now be predicted from sequence with high certainty, the prediction of protein functional dynamics remains to be achieved. Progress towards this goal will require a much larger experimental database of the relationships among sequence, dynamics, and function than currently available. Dynamic transitions that are key to p...", "tags": ["pubmed", "journal", "biology"], "authors": "Julien Roche, Christian Roumestand, Catherine A Royer", "extracted_chars": 23248, "has_fulltext": true, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Annual review of genomics and human genetics", "source_type": "pubmed", "title": "Artificial Intelligence in Human Genetics.", "url": "https://doi.org/10.1146/annurev-genom-111124-032550", "one_liner": "Artificial intelligence (AI) technologies have recently undergone transformative growth in capabilities. In human genetics, AI is rapidly advancing our ability to reveal the effects of genetic variation. This review explores recent progress and remaining challenges across the diverse applications of AI in genotype-to-phenotype mapping, from predicting the...", "tags": ["pubmed", "journal", "biology"], "authors": "Nadav Brandes", "extracted_chars": 4261, "has_fulltext": true, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Nature communications", "source_type": "pubmed", "title": "TRIM13 in situ engineering boosts anti-inflammatory capacity of CAR-Ms for liver fibrosis therapy.", "url": "https://doi.org/10.1038/s41467-026-69858-3", "one_liner": "Chimeric antigen receptor macrophages (CAR-Ms) therapy has shown great promise in liver fibrosis, however limited anti-inflammatory capacity of CAR-Ms in the fibrotic foci compromises their anti-fibrotic potency. We here report tripartite motif containing 13 (TRIM13) engineered CAR-Ms for effectively manipulating the anti-inflammatory phenotype of CAR-Ms,...", "tags": ["pubmed", "journal", "biology"], "authors": "Jinxin Gao, Zhenmei Yang, Yudong Song, Lijuan Shao, Xianghui Dong, Caiping Li, Longyu Bo, Xiaotian Zhao, Maosen Han, Chunwei Tang, Zhipeng Fu, Kuan Dai, Yintao Li, Na Li, Tao Li, Chen Chen, Xinyi Jiang, Kun Zhao", "extracted_chars": 48575, "has_fulltext": true, "analysis": "CORE CLAIM:\nThe study designed an ROS-responsive lipid nanoparticle (ESLNP) that systemically delivers mRNA to fibrosis-associated macrophages, enabling their in situ reprogramming into anti-inflammatory, chimeric antigen receptor (CAR)-engineered cells (CAR-Ms) that specifically eliminate activated hepatic stellate cells (aHSCs) to treat fibrosis.\n\nMETHOD / APPROACH:\n1.  **Nan"}
{"bucket": "protein", "source": "PubMed — Human gene therapy", "source_type": "pubmed", "title": "An Engineered Adeno-Associated Virus Variant Enables Efficient Gene Editing in Human T Cells.", "url": "https://doi.org/10.1177/10430342261424779", "one_liner": "Chimeric antigen receptor T (CAR-T) cells, created by gene editing systems along with recombinant adeno-associated virus (rAAV), provide a promising strategy for treating leukemia. rAAVs serve as a safe and effective donor template for homology-directed repair because they can avoid integrating into the host genome. However, only a few AAV serotypes can e...", "tags": ["pubmed", "journal", "biology"], "authors": "Mi Leng, Chunmei Gan, Zhaoyue Zheng, Siwu He, Yu Liu, Lixing Zhou, Rui Cheng, Jiao Zhou, Lin Xiao, Jingya Ye, Zhian Chen, Liangting Xu, C Alexander Valencia, Hoi Yee Chow, Yan Zhang, Biao Dong", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — The Journal of chemical physics", "source_type": "pubmed", "title": "Diffusion crossover of protein molecules: Two-step coarse-graining and oscillating memory.", "url": "https://doi.org/10.1063/5.0320337", "one_liner": "A consistent treatment of anomalous diffusion requires a microcosmic framework that captures the underlying couplings between the relevant degrees of freedom. To this end, we employ a two-step coarse-graining procedure, in which protein molecules are modeled as generalized Brownian particles interacting harmonically with their neighbors, while the latter ...", "tags": ["pubmed", "journal", "biology"], "authors": "Wen Bao, Rui Xing, Hai-Yan Wang, Jing-Dong Bao", "extracted_chars": 0, "has_fulltext": false, "analysis": ""}
{"bucket": "protein", "source": "PubMed — PLoS computational biology", "source_type": "pubmed", "title": "PON-Del predictor for sequence retaining protein deletions.", "url": "https://doi.org/10.1371/journal.pcbi.1014020", "one_liner": "Protein deletions are frequent among both disease-causing and tolerated variants. Several mechanisms at the DNA, RNA and protein levels can lead to deletions. Many deletions are misclassified in the literature and databases, especially when the mRNA is degraded by the cellular quality-control mechanism. We developed a novel predictor for sequence retainin...", "tags": ["pubmed", "journal", "biology"], "authors": "Haoyang Zhang, Muhammad Kabir, Mauno Vihinen", "extracted_chars": 36361, "has_fulltext": true, "analysis": "CORE CLAIM:\nPON-Del is a novel predictor for short (1–10 amino acid) sequence-retaining protein deletions that demonstrates superior performance compared to existing tools and provides both binary (pathogenic/benign) and three-state (including variants of uncertain significance, VUS) predictions via a freely available web service.\n\nMETHOD / APPROACH:\nA comprehensive dataset of 4,243 short in-frame deletions was curated from ClinVar, LOVD, dbSNP, and UniProtKB, mapped to MANE-selected transcripts. A total of 611 features were extracted across four categories: context-based (sequence conservation around the deletion), content-based"}
{"bucket": "protein", "source": "PubMed — Signal transduction and targeted therapy", "source_type": "pubmed", "title": "Antiviral drug discovery and development: challenges and future directions.", "url": "https://doi.org/10.1038/s41392-025-02539-7", "one_liner": "The coronavirus disease 2019 (COVID-19) pandemic has stimulated extensive endeavors toward the development of therapeutic interventions targeting severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) and human proteins for viral infection control, encompassing numerous potential drugs and thousands of patients participating in clinical trials. Thes...", "tags": ["pubmed", "journal", "biology"], "authors": "Shaoqing Du, Xueping Hu, Ping Li, Shujing Xu, Meehyein Kim, Xinyong Liu, Peng Zhan", "extracted_chars": 100000, "has_fulltext": true, "analysis": ""}
{"bucket": "protein", "source": "PubMed — Journal of neural engineering", "source_type": "pubmed", "title": "Computational modeling for precision targeting of conductivity-clamped gene electrotransfer within the striatum of the human brain.", "url": "https://doi.org/10.1088/1741-2552/ae482a", "one_liner": "", "tags": ["pubmed", "journal", "biology"], "authors": "Keng-Yin Lai, Stephen L Mow, Mathumathi Manoharan, Lily J Pearson, Georg von Jonquieres, Jeremy L Pinyon, Edward N Crawford, Frederic von Wegner, Gary D Housley, Nigel H Lovell, Amr Al Abed", "extracted_chars": 384, "has_fulltext": false, "analysis": "CORE CLAIM:  \nNot stated in source text. The provided text is a CAPTCHA/security page, not a scientific article.\n\nMETHOD / APPROACH:  \nNot stated in source text. No research methodology is described.\n\nKEY EVIDENCE:  \nNot stated in source text. No data, results, or supporting evidence are presented.\n\nWHY IT MATTERS:  \nNot stated in source text. No scientific context or implications are discussed.\n\nLIMITATIONS / UNCERTAINTIES:  \nNot stated in source text. No limitations or uncertainties are identified.\n\nTERMS (simple explanations):  \nNot stated in source text. No technical or scientific terms are defined."}
{"bucket": "protein", "source": "PubMed — Biophysical journal", "source_type": "pubmed", "title": "In silico conformational dynamics of the α-actinin-2 actin-binding domain upon phosphorylation.", "url": "https://doi.org/10.1016/j.bpj.2026.02.035", "one_liner": "In primary cardiomyocyte cell cultures, α-actinin-2 phosphorylation at the actin-binding domain (ABD) increases with mechanical stress, facilitating adaptation to varying forces. Nevertheless, it is unknown whether these phosphorylation sites in α-actinin-2 have structural consequences that could explain differential binding to F-actin and influence sarco...", "tags": ["pubmed", "journal", "biology"], "authors": "Helene Tigro, Matthew C Childers, Michael Regnier, Christopher Solís", "extracted_chars": 11, "has_fulltext": false, "analysis": "CORE CLAIM:\nNot stated in source text.\n\nMETHOD / APPROACH:\nNot stated in source text.\n\nKEY EVIDENCE:\nNot stated in source text.\n\nWHY IT MATTERS:\nNot stated in source text.\n\nLIMITATIONS / UNCERTAINTIES:\nNot stated in source text.\n\nTERMS (simple explanations):\nNot stated in source text."}
{"bucket": "protein", "source": "PubMed — Communications biology", "source_type": "pubmed", "title": "BioStruct-Africa's scalable framework for AlphaFold-enabled research training and sustainable workforce development in Africa.", "url": "https://doi.org/10.1038/s42003-026-09711-x", "one_liner": "Artificial intelligence is rapidly transforming structural biology and accelerating access to protein structures, yet many Africa-based scientists still lack infrastructure, training opportunities, and sustained mentorship to fully benefit. Here, we describe BioStruct-Africa’s community-driven framework integrating AlphaFold, experimental structural biolo...", "tags": ["pubmed", "journal", "biology"], "authors": "Justice O Amofa, Juergen George, Noella A Okumu, Moses Ohene, Ermias M Terefe, Stany L Tsomene, Oluwatodimu C Tougue, Ifeoluwa O Bejide, Kevin C Nabukeera, Anita Y Nelson, Carlos S D Tagne, Patrick Y Osabutey, Aminata Ndiaye, David O Nkwe, Emmanuel C Ohaekenyem, Tolulope F Jolaiya, Harrison Banda, Omorede Ikponmwosa-Eweka, Woutouoba N David, Blessing B Ekpenyong, Abdoulaye Segda, Oudou Diabate, Aliyi H Jarso, Kaddu Arafat, Alyaa Elrashedy, Mulatu M Yadeta, Zipporah B Richard, Isaac E Omara, Tshepang Ndaba, InnocentMary I Ejiofor, Pierre F R Magwell, Mohamed Sedeek, Linda O Lazaro, Regan M Nyoni, Rossel A Oketch, Walter Odur, Yaser M Hassan, Peris Ambala, Courage Chandipwisa, Osim P Bassey, Laurah N Ondari, Udokang G Jonah, Christelle A Amoussou, Racheal C Kyomukama, Cedric Yamssi, Sunday C James, Abdoul K Kone, Oumar Ndiaye, Henry Ssenfuka, Agatha K Nyang'au, Yohana Amos, Hakiimu Kawalya, Bernard Mware, Washingtone J Adundo, Vanessa B Ngannang-Fezeu, Alphonse G Tandja, Ahmed H Abdellatif, Oladokun F Omowumi, Nsubuga M Luutu, Angelo K B Kouman, Doaa S Soliman, Nehemiah K Essilfie, James J Wabwile, Safiétou Sankhe, Fatoumata G Fofana, Walid Heiba, Yao Nasser, Appolinaire Djikeng, Eva Akurut, Andrew Walakira, Aurélien F A Moumbock, Julia J Griese, Calvin Tiengwe, Mama Ndi, Itziar S Martin, Michel Fodje, Nicolas V Rüffin, Katharina C Cramer, Jamaine Davis, Emmanuel Nji", "extracted_chars": 5386, "has_fulltext": true, "analysis": "CORE CLAIM:\nThe BioStruct-Africa Workshop Series successfully delivered scalable, high-quality hands-on training in structural biology (AlphaFold, X-Ray Crystallography, Cryo-EM, drug design) to early-career African scientists, demonstrating significant learning gains and high participant satisfaction, thereby validating a model for continent-wide capacity building.\n\nMETHOD / APPROACH:\nTwo intensive one-week workshops were conducted: a pilot in Douala, Cameroon (Oct 2024, 20 participants) and a flagship series in Nairobi, Kenya (Aug 2025, 101 participants from 18 countries). Training combined lectures and hands-on sessions. Effectiveness was evaluated using pre- and post-training assessments, an anonymous post-workshop survey (71 respondents in Nairobi), and comparative analysis with the 2024 pilot.\n\nKEY EVIDENCE:\n- **Demand & Participation:** 198 applications for 101 Nairobi spots; participants from 18 African countries, predominantly early-career (R1 category) and from Kenya (30%), Nigeria (15%), Uganda (10%), Cameroon (10%).\n- **Gender Balance:** Douala achieved parity (10/20 women); Nairobi had 40% women (40/101) because all eligible women applicants were selected. Male applicants comprised 69% (Douala) and 65% (Nairobi) of the applicant pool.\n- **Learning Gains:** Post-training assessment scores improved by over 10% compared to pre-training.\n- **S"}
{"bucket": "protein", "source": "PubMed — Analytical methods : advancing methods and applications", "source_type": "pubmed", "title": "A hydrophilic interaction UPLC-MS/MS quantitative method for the quantification of saracatinib in the human liver microsome matrix and its application in", "url": "https://doi.org/10.1039/d5ay02096d", "one_liner": "Saracatinib (AZD-0530; SRB) is a pharmaceutical agent produced by AstraZeneca and is currently undergoing clinical studies. It is classified as a dual-kinase inhibitor, exhibiting selective activity both as an Src inhibitor and a Bcr-Abl tyrosine kinase inhibitor. No metabolic stability study for SRB has been reported; hence, so the goal of the present st...", "tags": ["pubmed", "journal", "biology"], "authors": "Mohamed W Attwa, Adnan A Kadi", "extracted_chars": 4908, "has_fulltext": true, "analysis": "CORE CLAIM:\nThe study developed and validated a rapid, sensitive hydrophilic interaction ultra-performance liquid chromatography-tandem mass spectrometry (UPLC-MS/MS) method to quantify saracatinib in human liver microsome (HLM) matrix and applied it to assess the drug's in vitro metabolic stability, supplemented by in silico predictions of metabolic lability sites.\n\nMETHOD / APPROACH:\nSaracatinib and"}
